[
    [
        {
            "id": "1967",
            "citation_count": 3,
            "name": 3,
            "cx": 28.5975,
            "cy": -3616.47,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1969",
            "citation_count": 13,
            "name": 13,
            "cx": 28.5975,
            "cy": -3526.73,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "C67-1007",
            "name": "Transformational Decomposition: A Simple Description of an Algorithm for Transformational Analysis of {E}nglish Sentences",
            "publication_data": 1967,
            "citation": 3,
            "abstract": "In this paper, we will present a rather simplified description of an algorithm for transformational analysis (decomposition) of English sentences. Our purpose here is not to discuss the transformational theory, the full details of the theoretical formulations of the algorithm, or of the grammar. Rather, we will present a set of examples of the decomposition and some discussion of them with the hope that it will give enough insight into the capability of the algorithm and indicate to some extent the power of transformational analysis.",
            "cx": 1101.6,
            "cy": -3616.47,
            "rx": 124.402,
            "ry": 26.7407,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "C69-4701",
            "name": "Properties of Formal Grammars With Mixed Type of Rules and Their Linguistic Relevance",
            "publication_data": 1969,
            "citation": 13,
            "abstract": "In this paper, we will study a class of formal grammars with mixed types of rules. The reason for considering such grammars is that no single style (i.e., formal character of rules) of formal grammars is able to represent the various aspects of language structure in a natural way. Various considerations for setting up such grammars have been discussed. Generation schemes which map strings in the language of one mixed grammar into strings in the language of another mixed grammar (both strings being 'well-formed') have been studied. Linguistic relevance of these concepts has also been discussed.",
            "cx": 1101.6,
            "cy": -3526.73,
            "rx": 99.9045,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "1975",
            "citation_count": 4,
            "name": 4,
            "cx": 28.5975,
            "cy": -3436.99,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "C88-2121",
            "name": "Parsing Strategies with {`}Lexicalized{'} Grammars: Application to {T}ree {A}djoining {G}rammars",
            "publication_data": 1988,
            "citation": 202,
            "abstract": "In this paper we present a general parsing strategy that arose from the development of an Earley-type parsing algorithm for TAGs (Schabes and Joshi 1988) and from recent linguistic work in TAGs (Abeille 1988).In our approach elementary structures are associated with their lexical heads. These structures specify extended domains of locality (as compared to a context-free grammar) over which constraints can be stated. These constraints either hold within the elementary structure itself or specify what other structures can be composed with a given elementary structure.We state the conditions under which context-free based grammars can be 'lexicalized' without changing the linguistic structures originally produced. We argue that even if one extends the domain of locality of CFGs to trees, using only substitution does not give the freedom to choose the head of each structure. We show how adjunction allows us to 'lexicalize' a CFG freely.We then show how a 'lexicalized' grammar naturally follows from the extended domain of locality of TAGs and present some of the linguistic advantages of our approach.A novel general parsing strategy for 'lexicalized' grammars is discussed. In a first stage, the parser builds a set structures corresponding to the input sentence and in a second stage, the sentence is parsed with respect to this set. The strategy is independent of the linguistic theory adopted and of the underlying grammar formalism. However, we focus our attention on TAGs. Since the set of trees needed to parse an input sentence is supposed to be finite, the parser can use in principle any search strategy. Thus, in particular, a top-down strategy can be used since problems due to recursive structures are eliminated. The parser is also able to use non-local information to guide the search.We then explain how the Earley-type parser for TAGs can be modified to take advantage of this approach.",
            "cx": 1279.6,
            "cy": -2449.85,
            "rx": 77.5641,
            "ry": 26.7407,
            "stroke": "red",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "H89-2053",
            "name": "An Evaluation of Lexicalization in Parsing",
            "publication_data": 1989,
            "citation": 0,
            "abstract": "In this paper, we evaluate a two-pass parsing strategy proposed for the so-called 'lexicalized' grammar. In 'lexicalized' grammars (Schabes, Abeille and Joshi, 1988), each elementary structure is systematically associated with a lexical item called anchor. These structures specify extended domains of locality (as compared to CFGs) over which constraints can be stated. The 'grammar' consists of a lexicon where each lexical item is associated with a finite number of structures for which that item is the anchor. There are no separate grammar rules. There are, of course, 'rules' which tell us how these structures are combined.A general two-pass parsing strategy for 'lexicalized' grammars follows naturally. In the first stage, the parser selects a set of elementary structures associated with the lexical items in the input sentence, and in the second stage the sentence is parsed with respect to this set. We evaluate this strategy with respect to two characteristics. First, the amount of filtering on the entire grammar is evaluated: once the first pass is performed, the parser uses only a subset of the grammar. Second, we evaluate the use of non-local information: the structures selected during the first pass encode the morphological value (and therefore the position in the string) of their anchor; this enables the parser to use non-local information to guide its search.We take Lexicalized Tree Adjoining Grammars as an instance of lexicalized grammar. We illustrate the organization of the grammar. Then we show how a general Earley-type TAG parser (Schabes and Joshi, 1988) can take advantage of lexicalization. Empirical data show that the filtering of the grammar and the non-local information provided by the two-pass strategy improve the performance of the parser.",
            "cx": 919.597,
            "cy": -2360.11,
            "rx": 71.3357,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H89-1036",
            "name": "Lexicalized {TAG}s, Parsing and Lexicons",
            "publication_data": 1989,
            "citation": 2,
            "abstract": "In our approach, each elementary structure is systematically associated with a lexical head. These structures specify extended domains of locality (as compared to a context-free grammar) over which constraints can be stated. These constraints either hold within the elementary structure itself or specify what other structures can be composed with a given elementary structure. The 'grammar' consists of a lexicon where each lexical item is associated with a finite number of structures for which that item is the head. There are no separate grammar rules. There are, of course, 'rules' which tell us how these structures are composed. A grammar of this form will be said to be 'lexicalized'. A 'lexicalized' grammar naturally follows from the extended domain of locality of TAGs.A general parsing strategy for 'lexicalized' grammars is discussed. In the first stage, the parser selects a set of elementary structures associated with the lexical items in the input sentence, and in the second stage the sentence is parsed with respect to this set. An Earley-type parser for TAGs has been has been developed. It can be adapted to take advantage of the two steps parsing strategy. The system parses unification formalisms that have a CFG skeleton and that have a TAG skeleton.Along with the development of an Earley-type parser for TAGs, lexicons for English are under development. A lexicons for French is also being developed. Subsets of these lexicons are being incrementally interfaced to the parser.We finally show how idioms are represented in lexicalized TAGs. We assign them regular syntactic structures while representing them semantically as one entry. We finally show how they can be parsed by a parsing strategy as mentioned above.",
            "cx": 1101.6,
            "cy": -2360.11,
            "rx": 92.7622,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1977",
            "citation_count": 0,
            "name": 0,
            "cx": 28.5975,
            "cy": -3347.25,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "T75-2017",
            "name": "A Formalism for Relating Lexical and Pragmatic Information: Its Relevance to Recognition and Generation",
            "publication_data": 1975,
            "citation": 4,
            "abstract": "None",
            "cx": 1303.6,
            "cy": -3436.99,
            "rx": 66.4361,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1978",
            "citation_count": 8,
            "name": 8,
            "cx": 28.5975,
            "cy": -3257.51,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "J77-1008",
            "name": "Computation of a Subclass of Inferences: Presupposition and Entailment",
            "publication_data": 1977,
            "citation": "???",
            "abstract": "None",
            "cx": 1348.6,
            "cy": -3347.25,
            "rx": 111.032,
            "ry": 26.7407,
            "stroke": "red",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "1979",
            "citation_count": 0,
            "name": 0,
            "cx": 28.5975,
            "cy": -3167.77,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "T78-1026",
            "name": "A Note on Partial Match of Descriptions. Can One Simultaneously Question (Retrieve) and Inform (Update)?",
            "publication_data": 1978,
            "citation": 4,
            "abstract": "None",
            "cx": 1303.6,
            "cy": -3257.51,
            "rx": 66.4361,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "J78-3034",
            "name": "A Note on Partial Match of Descriptions. Can One Simultaneously Question (Retrieve) and Inform (Update)?",
            "publication_data": 1978,
            "citation": 4,
            "abstract": "None",
            "cx": 1454.6,
            "cy": -3257.51,
            "rx": 66.4361,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1980",
            "citation_count": 2,
            "name": 2,
            "cx": 28.5975,
            "cy": -3078.03,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "P79-1008",
            "name": "Knowledge Organization and Application: Brief Comments on Papers in the Session",
            "publication_data": 1979,
            "citation": 0,
            "abstract": "Brackman describes a l a t t i ce l i ke structured inheritance network (KLONE) as a language for exp l i c i t representation of natural language conceptual information. Multiple descriptions can be represented. How does the f a c i l i t y d i f fe r from a similar one in KRL? Belief representations appear to be only impl ic i t . Quantification is handled through a set of structural descriptions. I t is not clear how negation is handled. The main application is for the command and control of advanced graphics manioulators through natural language. Is there an impl ic i t claim here that the KLONE representations are suitable for both natural language concepts as well as for those in the visual domain?",
            "cx": 1341.6,
            "cy": -3167.77,
            "rx": 103.889,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1982",
            "citation_count": 213,
            "name": 213,
            "cx": 28.5975,
            "cy": -2988.29,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "P80-1009",
            "name": "Parasession on Topics in Interactive Discourse Influence of the Problem Context",
            "publication_data": 1980,
            "citation": 0,
            "abstract": "My comments are organized within the framework suggested by the Panel Chair, Barbara Grosz, which I find very appropriate. All of my comments pertain to the various issues raised by her; however, wherever possible I will discuss these issues more in the context of the information seeking interaction and the data base domain.The primary question is how the purpose of the interaction or the problem context affects what is said and how it is interpreted. The two separate aspects of this question that must be considered are the function and the domain of the discourse.",
            "cx": 1343.6,
            "cy": -3078.03,
            "rx": 106.132,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "P80-1012",
            "name": "Phrase Structure Trees Bear More Fruit Than You Would Have Thought",
            "publication_data": 1980,
            "citation": 2,
            "abstract": "In this paper we will present several results concerning phrase structure trees. These results show that phrase structure trees, when viewed in certain ways, have much more descriptive power than one would have thought. We have given a brief account of local constraints on structural descriptions and an intuitive proof of a theorem about local constraints. We have compared the local constraints approach to some aspects of Gazdar's framework and that of Peters and Ritchie and of Karttunen. We have also presented some results on skeletons (phrase structure trees without labels) which show that phrase structure trees, even when deprived of the labels, retain in a certain sense all the structural information. This result has implications for grammatical inference procedures.",
            "cx": 1553.6,
            "cy": -3078.03,
            "rx": 86.0347,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1983",
            "citation_count": 326,
            "name": 326,
            "cx": 28.5975,
            "cy": -2898.55,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "P82-1023",
            "name": "Twenty Years of Reflections",
            "publication_data": 1982,
            "citation": 0,
            "abstract": "None",
            "cx": 2465.6,
            "cy": -2988.29,
            "rx": 89.191,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "J82-1001",
            "name": "Phrase Structure Trees Bear More Fruit than You Would Have Thought",
            "publication_data": 1982,
            "citation": 29,
            "abstract": "In this paper we will present several results concerning phrase structure trees. These results show that phrase structure trees, when viewed in certain ways, have much more descriptive power than one would have thought. We have given a brief account of local constraints on structural descriptions and an intuitive proof of a theorem about local constraints. We have compared the local constraints approach to some aspects of Gazdar's framework and that of Peters and Ritchie and of Karttunen. We have also presented some results on skeletons (phrase structure trees without labels) which show that phrase structure trees, even when deprived of the labels, retain in a certain sense all the structural information. This result has implications for grammatical inference procedures.",
            "cx": 3795.6,
            "cy": -2988.29,
            "rx": 86.0347,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "P83-1002",
            "name": "Factoring Recursion and Dependencies: An Aspect of {T}ree {A}djoining {G}rammars ({TAG}) and a Comparison of Some Formal Properties of {TAG}s, {GPSG}s, {PLG}s, and {LPG}s",
            "publication_data": 1983,
            "citation": 16,
            "abstract": "D u r i n g t h e l a s t few y e a r s t h e r e i s v i g o r o u s activity In constructing highly constrained grammatical systems by eliminating the transformational component either totally or partially. There is increasing recognition of t he f a c t t h a t the e n t i r e r a n g e o f d e p e n d e n c i e s t h a t t r a n s f o r m a t i o n a l g r a m m a r s i n t h e i r v a r i o u s i n c a r n a t i o n s have t r i e d t o a c c o u n t f o r c a n be satisfactorily captured by classes of rules that are non-transformational and at the same Clme highly constrlaned in terms of the classes of g r a m m a r s and l a n g u a g e s t h a t t h e y de f i n e .",
            "cx": 3795.6,
            "cy": -2898.55,
            "rx": 96.7474,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "C82-1023",
            "name": "Processing of Sentences With Intra-Sentential Code-Switching",
            "publication_data": 1982,
            "citation": 163,
            "abstract": "Speakers of certain bilingual communities systematically produce utterances in which they switch from one language to another, suggesting that the two language systems systematically interact with each other in the production (and recognition) of these sentences. We have investigated this phenomenon in a formal or computational framework which consists of two grammatical systems and a mechanism for switching between the two systems. A variety of constraints apparent in these sentences are then explained in terms of constraints on the switching mechanism, especially, those on closed class items.",
            "cx": 4003.6,
            "cy": -2988.29,
            "rx": 103.476,
            "ry": 26.7407,
            "stroke": "red",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "C82-1066",
            "name": "Taking the Initiative in Natural Language Data Base Interactions: Justifying Why",
            "publication_data": 1982,
            "citation": 21,
            "abstract": "None",
            "cx": 4208.6,
            "cy": -2988.29,
            "rx": 84.2917,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "1984",
            "citation_count": 33,
            "name": 33,
            "cx": 28.5975,
            "cy": -2808.81,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "P83-1007",
            "name": "Providing a Unified Account of Definite Noun Phrases in Discourse",
            "publication_data": 1983,
            "citation": 309,
            "abstract": "Citation Grosz, Barbara J., Aravind K. Joshi, and Scott Weinstein. 1983. Providing a unified account of definite noun phrases in discourse. In 21st Annual Meeting of the Association for Computational Linguistics: proceedings of the conference : 15-17 June 1983, Massachusetts Institute of Technology, Cambridge, Massachusetts, ed. Association for Computational Linguistics, 44-50. Morristown, N.J.: Association for Computational Linguistics.",
            "cx": 3581.6,
            "cy": -2898.55,
            "rx": 98.9899,
            "ry": 26.7407,
            "stroke": "black",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "P84-1029",
            "name": "Preventing False Inferences",
            "publication_data": 1984,
            "citation": 33,
            "abstract": "None",
            "cx": 3517.6,
            "cy": -2808.81,
            "rx": 101.233,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "J95-2003",
            "name": "{C}entering: A Framework for Modeling the Local Coherence of Discourse",
            "publication_data": 1995,
            "citation": 1408,
            "abstract": "This paper concerns relationships among focus of attention, choice of referring expression, and perceived coherence of utterances within a discourse segment. It presents a framework and initial theory of centering intended to model the local component of attentional state. The paper examines interactions between local coherence and choice of referring expressions; it argues that differences in coherence correspond in part to the inference demands made by different types of referring expressions, given a particular attentional state. It demonstrates that the attentional state properties modeled by centering can account for these differences.",
            "cx": 3646.6,
            "cy": -1821.67,
            "rx": 109.703,
            "ry": 26.7407,
            "stroke": "black",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "A83-1001",
            "name": "Domain-Independent Natural Language Interfaces: Session Introduction",
            "publication_data": 1983,
            "citation": 1,
            "abstract": "None",
            "cx": 4052.6,
            "cy": -2898.55,
            "rx": 142.257,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1985",
            "citation_count": 113,
            "name": 113,
            "cx": 28.5975,
            "cy": -2719.07,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H86-1017",
            "name": "Living Up to Expectations: Computing Expert Responses",
            "publication_data": 1986,
            "citation": 3,
            "abstract": "In cooperative man-machine interaction, it is necessary but not sufficient for a system to respond truthfully and informatively to a user's question. In particular, if the system has reason to believe that its planned response might mislead the user, then it must block that conclusion by modifying its response. This paper focusses on identifying and avoiding potentially misleading responses by acknowledging types of informing behavior usually expected of an expert. We attempt to give a formal account of several types of assertions that should be included in response to questions concerning the achievement of some goal (in addition to the simple answer), lest the questioner otherwise be misled.",
            "cx": 3517.6,
            "cy": -2629.33,
            "rx": 84.2917,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1986",
            "citation_count": 99,
            "name": 99,
            "cx": 28.5975,
            "cy": -2629.33,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "P85-1011",
            "name": "Some Computational Properties of {T}ree {A}djoining {G}rammars",
            "publication_data": 1985,
            "citation": 113,
            "abstract": "Tree Adjoining Grammar (TAG) is a formalism for natural language grammars. Some of the basic notions of TAG's were introduced in [Joshi, Levy, and Takahashi 1975] and by [Joshi, 1983]. A detailed investigation of the linguistic relevance of TAG's has been carried out in [Kroch and Joshi, 1985]. In this paper, we will describe some new results for TAG's, especially in the following areas: (1) parsing complexity of TAG's, (2) some closure results for TAG's, and (3) the relationship to Head grammars.",
            "cx": 635.597,
            "cy": -2719.07,
            "rx": 101.647,
            "ry": 26.7407,
            "stroke": "red",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "C86-1048",
            "name": "Tree Adjoining and Head Wrapping",
            "publication_data": 1986,
            "citation": 30,
            "abstract": "In this paper we discuss the formal relationship between thw classes of languages generated by Tree Adjoining Grammars and Head Grammars. In particular, we show that Head Languages are included in Tree Adjoining Languages and that Tree Adjoining Grammars are equivalent to a modification of Head Grammars called Modified Head Grammars. The inclusion of MHL in HL, and thus the equivalence of HG's and TAG's in the most general case remains to be established.",
            "cx": 504.597,
            "cy": -2629.33,
            "rx": 96.7474,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "P88-1032",
            "name": "An {E}arley-Type Parsing Algorithm for {T}ree {A}djoining {G}rammars",
            "publication_data": 1988,
            "citation": 61,
            "abstract": "We will describe an Earley-type parser for Tree Adjoining Grammars (TAGs). Although a CKY-type parser for TAGs has been developed earlier (Vijay-Shanker and Joshi, 1985), this is the first practical parser for TAGs because as is well known for CFGs, the average behavior of Earley-type parsers is superior to that of CKY-type parsers. The core of the algorithm is described. Then we discuss modifications of the parsing algorithm that can parse extensions of TAGs such as constraints on adjunction, substitution, and feature structures for TAGs. We show how with the use of substitution in TAGs the system is able to parse directly CFGs and TAGs. The system parses unification formalisms that have a CFG skeleton and also those with a TAG skeleton. Thus it also allows us to embed the essential aspects of PATR-II.",
            "cx": 799.597,
            "cy": -2449.85,
            "rx": 60.623,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "H05-1102",
            "name": "Incremental {LTAG} Parsing",
            "publication_data": 2005,
            "citation": 33,
            "abstract": "We present a very efficient statistical incremental parser for LTAG-spinal, a variant of LTAG. The parser supports the full adjoining operation, dynamic predicate coordination, and non-projective dependencies, with a formalism of provably stronger generative capacity as compared to CFG. Using gold standard POS tags as input, on section 23 of the PTB, the parser achieves an f-score of 89.3% for syntactic dependency defined on LTAG derivation trees, which are deeper than the dependencies extracted from PTB alone with head rules (for example, in Magerman's style).",
            "cx": 1311.6,
            "cy": -1103.75,
            "rx": 92.7622,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "1987",
            "citation_count": 228,
            "name": 228,
            "cx": 28.5975,
            "cy": -2539.59,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "J86-1015",
            "name": "Three Titles from the {C}ambridge Series: {S}TUDIES IN {N}ATURAL {L}ANGUAGE {P}ROCESSING",
            "publication_data": 1986,
            "citation": "???",
            "abstract": "None",
            "cx": 3756.6,
            "cy": -2629.33,
            "rx": 82.0488,
            "ry": 26.7407,
            "stroke": "red",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "H86-1005",
            "name": "Research in Natural Language Processing",
            "publication_data": 1986,
            "citation": 0,
            "abstract": "The main objective is to develop robust methods for the understanding and generation of both written and spoken human language, including but not limited to English. Penn is pursuing development of: (1) New mathematical and computational frameworks which are highly constrained, yet adequate to allow a simple, concise description of complex linguistic phenomena. These new frameworks are tested by the explicit encoding within each framework of a wide range of phenomena across a diverse set of human languages. (2) Both statistical and symbolic learning methods which automatically extract and effectively utilize the implicit linguistic knowledge in the Penn Treebank and the corpora of the Linguistic Data Consortium. These techniques have been tested against the performance of the best current methods.",
            "cx": 3952.6,
            "cy": -2629.33,
            "rx": 96.3333,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H86-1020",
            "name": "Some Computational Properties of {T}ree {A}djoining {G}rammars",
            "publication_data": 1986,
            "citation": 66,
            "abstract": "Tree Adjoining Grammar (TAG) is a formalism for natural language grammars. Some of the basic notions of TAG's were introduced in [Joshi, Levy, and Takahashi 1975] and by [Joshi, 1983]. A detailed investigation of the linguistic relevance of TAG's has been carried out in [Kroch and Joshi, 1985]. In this paper, we will describe some new results for TAG's, especially in the following areas: (1) parsing complexity of TAG's, (2) some closure results for TAG's, and (3) the relationship to Head grammars.",
            "cx": 2119.6,
            "cy": -2629.33,
            "rx": 101.647,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "T87-1011",
            "name": "Unification and Some New Grammatical Formalisms",
            "publication_data": 1987,
            "citation": 4,
            "abstract": "The key idea in the unification-based approaches to grammar is that we deal with informational structures (called feature structures) which encode a variety of linguistic information (lexical, syntactic, semantic, discourse, perhaps even cross-linguistic) in a uniform way and then manipulate (combine) these structures by means of a few (one, if possible) welldefined operations (unification being the primary one). The feature structures consist of features and associated values, which can be atomic or complex i.e., feature structures themselves. In other'words, the values can be from a structured set. The unification operation builds new structures and together with some string combining operation (concatenation being the primary one) pairs the feature structures with strings (Schieber, 1986).",
            "cx": 504.597,
            "cy": -2539.59,
            "rx": 102.561,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "P88-1034",
            "name": "{C}ombinatory {C}ategorial {G}rammars: Generative Power and Relationship to Linear Context-Free Rewriting Systems",
            "publication_data": 1988,
            "citation": 39,
            "abstract": "Recent results have established that there is a family of languages that is exactly the class of languages generated by three independently developed grammar formalisms: Tree Adjoining Grammars, Head Grammars, and Linear Indexed Grammars. In this paper we show that Combinatory Categorial Grammars also generates the same class of languages. We discuss the structural descriptions produced by Combinatory Categorial Grammars and compare them to those of grammar formalisms in the class of Linear Context-Free Rewriting Systems. We also discuss certain extensions of Combinatory Categorial Grammars and their effect on the weak generative capacity.",
            "cx": 367.597,
            "cy": -2449.85,
            "rx": 113.689,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "1988",
            "citation_count": 302,
            "name": 302,
            "cx": 28.5975,
            "cy": -2449.85,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "T87-1041",
            "name": "Generation - A New Frontier of Natural Language Processing?",
            "publication_data": 1987,
            "citation": 7,
            "abstract": "None",
            "cx": 3777.6,
            "cy": -2539.59,
            "rx": 102.561,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "P87-1015",
            "name": "Characterizing Structural Descriptions Produced by Various Grammatical Formalisms",
            "publication_data": 1987,
            "citation": 217,
            "abstract": "We consider the structural descriptions produced by various grammatical formalisms in terms of the complexity of the paths and the relationship between paths in the sets of structural descriptions that each system can generate. In considering the relationship between formalisms, we show that it is useful to abstract away from the details of the formalism, and examine the nature of their derivation process as reflected by properties of their derivation trees. We find that several of the formalisms considered can be seen as being closely related since they have derivation tree sets with the same structure as those produced by Context-Free Grammars. On the basis of this observation, we describe a class of formalisms which we call Linear Context-Free Rewriting Systems, and show they are recognizable in polynomial time and generate only semilinear languages.",
            "cx": 210.597,
            "cy": -2539.59,
            "rx": 135.115,
            "ry": 26.7407,
            "stroke": "red",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "P89-1027",
            "name": "Treatment of Long Distance Dependencies in {LFG} and {TAG}: Functional Uncertainty in {LFG} Is a Corollary in {TAG}",
            "publication_data": 1989,
            "citation": 7,
            "abstract": "In this paper the functional uncertainty machinery in LFG is compared with the treatment of long distance dependencies in TAG. It is shown that the functional uncertainty machinery is redundant in TAG, i.e., what functional uncertainty accomplishes for LFG follows from the TAG formalism itself and some aspects of the linguistic theory instantiated in TAG. It is also shown that the analyses provided by the functional uncertainty machinery can be obtained without requiring power beyond mildly context-sensitive grammars. Some linguistic and computational aspects of these results have been briefly discussed also.",
            "cx": 367.597,
            "cy": -2360.11,
            "rx": 98.9899,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1989",
            "citation_count": 18,
            "name": 18,
            "cx": 28.5975,
            "cy": -2360.11,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "C96-2103",
            "name": "Coordination in {T}ree {A}djoining {G}rammars: Formalization and Implementation",
            "publication_data": 1996,
            "citation": 39,
            "abstract": "In this paper we show that an account for coordination can be constructed using the derivation structures in a lexicalized Tree Adjoining Grammar (LTAG). We present a notion of derivation in LTAGs that preserves the notion of fixed constituency in the LTAG lexicon while providing the flexibility needed for coordination phenomena. We also discuss the construction of a practical parser for LTAGs that can handle coordination including cases of non-constituent coordination.",
            "cx": 1311.6,
            "cy": -1731.93,
            "rx": 107.46,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "H90-1010",
            "name": "Two Recent Developments in {T}ree {A}djoining {G}rammars: Semantics and Efficient Processing",
            "publication_data": 1990,
            "citation": 0,
            "abstract": "During the past year there have been two very significant developments in the area of Tree Adjoining Grammars (TAGs).The first development is a variant of TAGs, called synchronous TAGs, which allows TAG to be used beyond the confines of syntax by characterizing correspondences between languages. The formalism's intended usage is to relate expressions of natural languages to their associated semantics represented by a logical form language in TAG, or to their translates in another natural language. The formalism is incremental and inherently nondirectional. We will show by detailed examples the working of synchronous TAGs and some of its applications, for example in generation and in machine translation.The second development is the design of LR-style parsers for TAGs. LR parsing strategies evolved out of the original work of Knuth. Even though they are not powerful enough for NLP, they have found use in natural language processing (NLP) by solving by pseudo-parallelism conflicts between multiple choices. This gives rise to a class of powerful yet efficient parsers for natural language. In order to extend the LR techniques to TAGs it is necessary to find bottom-up automaton that is exactly equivalent to TAGs. This is precisely what has been achieved by the discovery of the Bottom-up Embedded Push Down Automaton (BEPDA). Using BEPDA, deterministic left to right parsers for the Tree Adjoining Languages have been developed.",
            "cx": 1425.6,
            "cy": -2270.37,
            "rx": 67.3507,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "C90-3001",
            "name": "Using Lexicalized Tags for Machine Translation",
            "publication_data": 1990,
            "citation": 73,
            "abstract": "Lexicalized Tree Adjoining Grammar (LTAG) is an attractive formalism for linguistic description mainly because of its extended domain of locality and its factoring recursion out from the domain of local dependencies (Joshi, 1985, Kroch and Joshi, 1985, Abeille, 1988). LTAG's extended domain of locality enables one to localize syntactic dependencies (such as filler-gap), as well as semantic dependencies (such as predicate-arguments). The aim of this paper is to show that these properties combined with the lexicalized property of LTAG are especially attractive for machine translation.The transfer between two languages, such as French and English, can be done by putting directly into correspondence large elementary units without going through some interlingual representation and without major changes to the source and target grammars. The underlying formalism for the transfer is synchronous Tree Adjoining Grammars (Shieber and Schabes [1990]). Transfer rules are stated as correspondences between nodes of trees of large domain of locality which are associated with words. We can thus define lexical transfer rules that avoid the defects of a mere word-to-word approach but still benefit from the simplicity and elegance of a lexical approach.We rely on the French and English LTAG grammars (Abeille [1988], Abeille [1990 (b)], Abeille et al. [1990], Abeille and Schabes [1989, 1990]) that have been designed over the past two years jointly at University of Pennsylvania and University of Paris 7-Jussieu.",
            "cx": 1268.6,
            "cy": -2270.37,
            "rx": 71.3357,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "H91-1035",
            "name": "Fixed and Flexible Phrase Structure: Coordination in {T}ree {A}djoining {G}rammars",
            "publication_data": 1991,
            "citation": 8,
            "abstract": "Phrase-structure grammars assign a unique phrase structure (constituency) to an unambiguous sentence. Thus, for example, John likes apples will be bracketed as follows (ignoring the phrase labels and ignoring some brackets not essential for our present purpose):(1) (John (likes apples))",
            "cx": 1668.6,
            "cy": -2180.63,
            "rx": 82.0488,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "E91-1005",
            "name": "Long-Distance Scrambling and {T}ree {A}djoining {G}rammars",
            "publication_data": 1991,
            "citation": 74,
            "abstract": "None",
            "cx": 775.597,
            "cy": -2180.63,
            "rx": 111.946,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "A92-1030",
            "name": "{XTAG} - A Graphical Workbench for Developing {T}ree-{A}djoining {G}rammars",
            "publication_data": 1992,
            "citation": 27,
            "abstract": "We describe a workbench (XTAG) for the development of tree-adjoining grammars and their parsers, and discuss some issues that arise in the design of the graphical interface.Contrary to string rewriting grammars generating trees, the elementary objects manipulated by a tree-adjoining grammar are extended trees (i.e. trees of depth one or more) which capture syntactic information of lexical items. The unique characteristics of tree-adjoining grammars, its elementary objects found in the lexicon (extended trees) and the derivational history of derived trees (also a tree), require a specially crafted interface in which the perspective has shifted from a string-based to a tree-based system. XTAG provides such a graphical interface in which the elementary objects are trees (or tree sets) and not symbols (or strings).The kernel of XTAG is a predictive left to right parser for unification-based tree-adjoining grammar [Schabes, 1991]. XTAG includes a graphical editor for trees, a graphical tree printer, utilities for manipulating and displaying feature structures for unification-based tree-adjoining grammar, facilities for keeping track of the derivational history of TAG trees combined with adjoining and substitution, a parser for unification based tree-adjoining grammars, utilities for defining grammars and lexicons for tree-adjoining grammars, a morphological recognizer for English (75 000 stems deriving 280 000 inflected forms) and a tree-adjoining grammar for English that covers a large range of linguistic phenomena.Considerations of portability, efficiency, homogeneity and ease of maintenance, lead us to the use of Common Lisp without its object language addition and to the use of the X Window interface to Common Lisp (CLX) for the implementation of XTAG.XTAG without the large morphological and syntactic lexicons is public domain software. The large morphological and syntactic lexicons can be obtained through an agreement with ACL's Data Collection Initiative.XTAG runs under Common Lisp and X Window (CLX).",
            "cx": 1268.6,
            "cy": -2090.89,
            "rx": 94.5053,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "C94-1024",
            "name": "Disambiguation of Super Parts of Speech (or Supertags): Almost Parsing",
            "publication_data": 1994,
            "citation": 130,
            "abstract": "In a lexicalized grammar formalism such as Lexicalized Tree-Adjoining Grammar (LTAG), each lexical item is associated with at least one elementary structure (supertag) that localizes syntactic and semantic dependencies. Thus a parser for a lexicalized grammar must search a large set of supertags to choose the right ones to combine for the parse of the sentence. We present techniques for disambiguating supertags using local information such as lexical preference and local lexical dependencies. The similarity between LTAG and Dependency grammars is exploited in the dependency model of supertag disambiguation. The performance results for various models of supertag disambiguation such as unigram, trigram and dependency-based models are presented.",
            "cx": 1816.6,
            "cy": -1911.41,
            "rx": 120.417,
            "ry": 26.7407,
            "stroke": "red",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "P95-1036",
            "name": "Some Novel Applications of Explanation-Based Learning to Parsing {L}exicalized {T}ree-{A}djoining {G}rammars",
            "publication_data": 1995,
            "citation": 19,
            "abstract": "In this paper we present some novel applications of Explanation-Based Learning (EBL) technique to parsing Lexicalized Tree-Adjoining grammars. The novel aspects are (a) immediate generalization of parses in the training set, (b) generalization over recursive structures and (c) representation of generalized parses as Finite State Transducers. A highly impoverished parser called a stapler has also been introduced. We present experimental results using EBL for different corpora and architectures to show the effectiveness of our approach.",
            "cx": 1557.6,
            "cy": -1821.67,
            "rx": 83.3772,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "J99-2004",
            "name": "{S}upertagging: An Approach to Almost Parsing",
            "publication_data": 1999,
            "citation": 331,
            "abstract": "In this paper, we have proposed novel methods for robust parsing that integrate the flexibility of linguistically motivated lexical descriptions with the robustness of statistical techniques. Our thesis is that the computation of linguistic structure can be localized if lexical items are associated with rich descriptions (supertags) that impose complex constraints in a local context. The supertags are designed such that only those elements on which the lexical item imposes constraints appear within a given supertag. Further, each lexical item is associated with as many supertags as the number of different syntactic contexts in which the lexical item can appear. This makes the number of different descriptions for each lexical item much larger than when the descriptions are less complex, thus increasing the local ambiguity for a parser. But this local ambiguity can be resolved by using statistical distributions of supertag co-occurrences collected from a corpus of parses. We have explored these ideas in the context of the Lexicalized Tree-Adjoining Grammar (LTAG) framework. The supertags in LTAG combine both phrase structure information and dependency information in a single representation. Supertag disambiguation results in a representation that is effectively a parse (an almost parse), and the parser need only combine the individual supertags. This method of parsing can also be used to parse sentence fragments such as in spoken utterances where the disambiguated supertag sequence may not combine into a single structure.",
            "cx": 1592.6,
            "cy": -1552.45,
            "rx": 123.988,
            "ry": 26.7407,
            "stroke": "black",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "1990",
            "citation_count": 73,
            "name": 73,
            "cx": 28.5975,
            "cy": -2270.37,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W89-0235",
            "name": "The Relevance of Lexicalization to Parsing",
            "publication_data": 1989,
            "citation": 9,
            "abstract": "In this paper, we investigate the processing of the so-called {`}lexicalized{'} grammar. In {`}lexicalized{'} grammars (Schabes, Abeille and Joshi, 1988), each elementary structure is systema tically associated with a lexical {`}head{'}. These structures specify extended domains of locality (as compared to CFGs) over which constraints can be stated. The {`}grammar{'} consists of a lexicon where each lexical item is associated with a finite number of structures for which that item is the {`}head{'} . There are no separate grammar rules. There are, of course, {`}rules{'} which tell us how these structures are combined. A general two-pass parsing strategy for {`}lexicalized{'} grammars follows naturally. In the first stage, the parser selects a set of elementary structures associated with the lexical items in the input sentence, and in the second stage the sentence is parsed with respect to this set. We evaluate this strategy with respect to two characteristics. First, the amount of filtering on the entire grammar is evaluated: once the first pass is performed, the parser uses only a subset of the grammar. Second, we evaluate the use of non-local information: the structures selected during the first pass encode the morphological value (and therefore the position in the string) of their {`}head{'}; this enables the parser to use non-local in form ation to guide its search. We take Lexicalized Tree Adjoining Grammars as an in stance of lexicalized grammar. We illustrate the organization of the grammar. Then we show how a general Earley-type TAG parser (Schabes and Joshi, 1988) can take advantage of lexicalization. Empirical data show that the filtering of the grammar and the non-local in formation provided by the two-pass strategy improve the performance of the parser. We explain how constraints over the elementary structures expressed by unification equations can be parsed by a simple extension of the Earley-type TAG parser. Lexicalization guarantees termination of the algorithm without special devices such as restrictors.",
            "cx": 765.597,
            "cy": -2360.11,
            "rx": 64.1938,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H89-1035",
            "name": "Natural Language Research",
            "publication_data": 1989,
            "citation": "???",
            "abstract": "None",
            "cx": 3762.6,
            "cy": -2360.11,
            "rx": 87.8629,
            "ry": 26.7407,
            "stroke": "red",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "1991",
            "citation_count": 82,
            "name": 82,
            "cx": 28.5975,
            "cy": -2180.63,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W90-0214",
            "name": "A {TAG} analysis of the Third construction in {G}erman",
            "publication_data": 1990,
            "citation": "???",
            "abstract": "None",
            "cx": 775.597,
            "cy": -2270.37,
            "rx": 69.0935,
            "ry": 26.7407,
            "stroke": "black",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "W90-0217",
            "name": "Coordination in {TAG} in the manner of {CCG} (Combinatory Category Grammars): Fixed vs. Flexible Phrase Structure",
            "publication_data": 1990,
            "citation": 0,
            "abstract": "None",
            "cx": 3786.6,
            "cy": -2270.37,
            "rx": 111.946,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H90-1099",
            "name": "Natural Language Research",
            "publication_data": 1990,
            "citation": 0,
            "abstract": "The main objective is basic research and system development leading to (1) characterization of information carried by (a) syntax, semantics, and discourse structure, (b) their relation to information carried by intonation, and (c) development of methods for using this information for generation and understanding; (2) development of architectures for integration of utterance planning with lexical, syntactic and intonational choice; (3) development of incremental strategies for using syntactic, semantic, and pragmatic knowledge in understanding and generating language.",
            "cx": 4003.6,
            "cy": -2270.37,
            "rx": 87.8629,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1992",
            "citation_count": 27,
            "name": 27,
            "cx": 28.5975,
            "cy": -2090.89,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H91-1103",
            "name": "Natural Language Research",
            "publication_data": 1991,
            "citation": 0,
            "abstract": "None",
            "cx": 3762.6,
            "cy": -2180.63,
            "rx": 87.8629,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W08-2302",
            "name": "Flexible Composition, Multiple Adjoining and Word Order Variation",
            "publication_data": 2008,
            "citation": 3,
            "abstract": "None",
            "cx": 673.597,
            "cy": -834.531,
            "rx": 77.5641,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1991.iwpt-1.1",
            "name": "Proceedings of the Second International Workshop on Parsing Technologies ({IWPT} {'}91)",
            "publication_data": 1991,
            "citation": "???",
            "abstract": "February 13-25, 1991",
            "cx": 3975.6,
            "cy": -2180.63,
            "rx": 107.46,
            "ry": 26.7407,
            "stroke": "black",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "1993",
            "citation_count": 0,
            "name": 0,
            "cx": 28.5975,
            "cy": -2001.15,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H92-1019",
            "name": "Session 4: Statistical Language Modeling",
            "publication_data": 1992,
            "citation": "???",
            "abstract": "None",
            "cx": 3765.6,
            "cy": -2090.89,
            "rx": 90.5193,
            "ry": 26.7407,
            "stroke": "red",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "H92-1123",
            "name": "Natural Language Research",
            "publication_data": 1992,
            "citation": "???",
            "abstract": "None",
            "cx": 3961.6,
            "cy": -2090.89,
            "rx": 87.8629,
            "ry": 26.7407,
            "stroke": "red",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "1994",
            "citation_count": 130,
            "name": 130,
            "cx": 28.5975,
            "cy": -1911.41,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H93-1113",
            "name": "Natural Language Research",
            "publication_data": 1993,
            "citation": "???",
            "abstract": "None",
            "cx": 3762.6,
            "cy": -2001.15,
            "rx": 87.8629,
            "ry": 26.7407,
            "stroke": "red",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "1995",
            "citation_count": 1427,
            "name": 1427,
            "cx": 28.5975,
            "cy": -1821.67,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W94-0107",
            "name": "Complexity of Description of Primitives: Relevance to Local Statistical Computations",
            "publication_data": 1994,
            "citation": "???",
            "abstract": "None",
            "cx": 3779.6,
            "cy": -1911.41,
            "rx": 105.218,
            "ry": 26.7407,
            "stroke": "red",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "P94-1005",
            "name": "From Strings to Trees to Strings to Trees ... (Abstract)",
            "publication_data": 1994,
            "citation": 0,
            "abstract": "None",
            "cx": 3984.6,
            "cy": -1911.41,
            "rx": 81.135,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W00-1307",
            "name": "A Uniform Method of Grammar Extraction and Its Applications",
            "publication_data": 2000,
            "citation": 44,
            "abstract": "Grammars are core elements of many NLP applications. In this paper, we present a system that automatically extracts lexicalized grammars from annotated corpora. The data produced by this system have been used in several tasks, such as training NLP tools (such as Supertaggers) and estimating the coverage of hand-crafted grammars. We report experimental results on two of those tasks and compare our approaches with related work.",
            "cx": 1857.6,
            "cy": -1462.71,
            "rx": 47.2526,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "P03-1064",
            "name": "A {SN}o{W} Based Supertagger with Application to {NP} Chunking",
            "publication_data": 2003,
            "citation": 14,
            "abstract": "Supertagging is the tagging process of assigning the correct elementary tree of LTAG, or the correct supertag, to each word of an input sentence. In this paper we propose to use supertags to expose syntactic dependencies which are unavailable with POS tags. We first propose a novel method of applying Sparse Network of Winnow (SNoW) to sequential models. Then we use it to construct a supertagger that uses long distance syntactical dependencies, and the supertagger achieves an accuracy of 92.41%. We apply the supertagger to NP chunking. The use of supertags in NP chunking gives rise to almost 1% absolute increase (from 92.03% to 92.95%) in F-score under Transformation Based Learning(TBL) frame. The surpertagger described here provides an effective and efficient way to exploit syntactic information.",
            "cx": 1646.6,
            "cy": -1283.23,
            "rx": 54.3945,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "1996",
            "citation_count": 39,
            "name": 39,
            "cx": 28.5975,
            "cy": -1731.93,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "prasad-etal-2010-exploiting",
            "name": "Exploiting Scope for Shallow Discourse Parsing",
            "publication_data": 2010,
            "citation": 30,
            "abstract": "We present an approach to automatically identifying the arguments of discourse connectives based on data from the Penn Discourse Treebank. Of the two arguments of connectives, called Arg1 and Arg2, we focus on Arg1, which has proven more challenging to identify. Our approach employs a sentence-based representation of arguments, and distinguishes ''``intra-sentential connectives'''', which take both their arguments in the same sentence, from ''``inter-sentential connectives'''', whose arguments are found in different sentences. The latter are further distinguished by paragraph position into ''``ParaInit'''' connectives, which appear in a paragraph-initial sentence, and ''``ParaNonInit'''' connectives, which appear elsewhere. The paper focusses on predicting Arg1 of Inter-sentential ParaNonInit connectives, presenting a set of scope-based filters that reduce the search space for Arg1 from all the previous sentences in the paragraph to a subset of them. For cases where these filters do not uniquely identify Arg1, coreference-based heuristics are employed. Our analysis shows an absolute 3{\\%} performance improvement over the high baseline of 83.3{\\%} for identifying Arg1 of Inter-sentential ParaNonInit connectives.",
            "cx": 3474.6,
            "cy": -655.051,
            "rx": 96.7474,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W12-3205",
            "name": "Discourse Structure and Computation: Past, Present and Future",
            "publication_data": 2012,
            "citation": 18,
            "abstract": "The discourse properties of text have long been recognized as critical to language technology, and over the past 40 years, our understanding of and ability to exploit the discourse properties of text has grown in many ways. This essay briefly recounts these developments, the technology they employ, the applications they support, and the new challenges that each subsequent development has raised. We conclude with the challenges faced by our current understanding of discourse, and the applications that meeting these challenges will promote.",
            "cx": 3143.6,
            "cy": -475.571,
            "rx": 96.7474,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "1998",
            "citation_count": 59,
            "name": 59,
            "cx": 28.5975,
            "cy": -1642.19,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "1999",
            "citation_count": 389,
            "name": 389,
            "cx": 28.5975,
            "cy": -1552.45,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W98-0315",
            "name": "Anchoring a {L}exicalized {T}ree-{A}djoining {G}rammar for Discourse",
            "publication_data": 1998,
            "citation": 58,
            "abstract": "We here explore a ``fully'' lexicalized Tree-Adjoining Grammar for discourse that takes the basic elements of a (monologic) discourse to be not simply clauses, but larger structures that are anchored on variously realized discourse cues. This link with intra-sentential grammar suggests an account for different patterns of discourse cues, while the different structures and operations suggest three separate sources for elements of discourse meaning: (1) a compositional semantics tied to the basic trees and operations; (2) a presuppositional semantics carried by cue phrases that freely adjoin to trees; and (3) general inference, that draws additional, defeasible conclusions that flesh out what is conveyed compositionally.",
            "cx": 3166.6,
            "cy": -1642.19,
            "rx": 98.9899,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "P99-1006",
            "name": "Discourse Relations: A Structural and Presuppositional Account Using Lexicalised {TAG}",
            "publication_data": 1999,
            "citation": 58,
            "abstract": "We show that discourse structure need not bear the full burden of conveying discourse relations by showing that many of them can be explained nonstructurally in terms of the grounding of anaphoric presuppositions (Van der Sandt, 1992). This simplifies discourse structure, while still allowing the realisation of a full range of discourse relations. This is achieved using the same semantic machinery used in deriving clause-level semantics.",
            "cx": 2984.6,
            "cy": -1552.45,
            "rx": 96.7474,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W03-2608",
            "name": "Anaphoric arguments of discourse connectives: Semantic properties of antecedents versus non-antecedents",
            "publication_data": 2003,
            "citation": 19,
            "abstract": "We have argued extensively in prior work that discourse connectives can be analyzed as encoding predicate-argument relations whose arguments derived from the interpretation of discourse units. All adverbial connectives we have analyzed to date have expressed binary relations. But they are special in taking one of their two arguments structurally, and the other, anaphorically. As such, interpreting adverbial discourse connectives can be understood as a problem of anaphora resolution. In this paper we study the S-modifying adverbial connective xe2x80x9cinsteadxe2x80x9d and what, in the context, does and does not serve as antecedent for its anaphoric argument. This work extends earlier work investigating syntactic patterns of anaphoric arguments across a range of adverbial discourse connectives and the reliability with which these arguments can be annotated. The current work establishes, for 100 successive corpus instances of xe2x80x9cinsteadxe2x80x9d, lexico-syntactic features of the antecedents of their anaphoric arguments that can be automatically annotated and therefore used to distinguish actual antecedents from potential competitors in the context.",
            "cx": 3029.6,
            "cy": -1283.23,
            "rx": 89.6056,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "J03-4002",
            "name": "Anaphora and Discourse Structure",
            "publication_data": 2003,
            "citation": 190,
            "abstract": "We argue in this article that many common adverbial phrases generally taken to signal a discourse relation between syntactically connected units within discourse structure instead work anaphorically to contribute relational meaning, with only indirect dependence on discourse structure. This allows a simpler discourse structure to provide scaffolding for compositional semantics and reveals multiple ways in which the relational meaning conveyed by adverbial connectives can interact with that associated with discourse structure. We conclude by sketching out a lexicalized grammar for discourse that facilitates discourse interpretation as a product of compositional rules, anaphor resolution, and inference.",
            "cx": 2825.6,
            "cy": -1283.23,
            "rx": 96.3333,
            "ry": 26.7407,
            "stroke": "black",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "W04-2703",
            "name": "Annotating Discourse Connectives and Their Arguments",
            "publication_data": 2004,
            "citation": 74,
            "abstract": "This paper describes a new, large scale discourse-level annotation project xe2x80x93 the Penn Discourse TreeBank (PDTB). We present an approach to annotating a level of discourse structure that is based on identifying discourse connectives and their arguments. The PDTB is being built directly on top of the Penn TreeBank and Propbank, thus supporting the extraction of useful syntactic and semantic features and providing a richer substrate for the development and evaluation of practical algorithms. We provide a detailed preliminary analysis of inter-annotator agreement xe2x80x93 both the level of agreement and the types of inter-annotator variation.",
            "cx": 2664.6,
            "cy": -1193.49,
            "rx": 91.4341,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W04-2704",
            "name": "{P}roposition {B}ank {II}: Delving Deeper",
            "publication_data": 2004,
            "citation": 13,
            "abstract": "The PropBank project is creating a corpus of text annotated with information about basic semantic propositions. PropBank I (Kingsbury & Palmer, 2002) added a layer of predicateargument information, or semantic roles, to the syntactic structures of the English Penn Treebank. This paper presents an overview of the second phase of PropBank Annotation, PropBank II, which is being applied to English and Chinese, and includes (Neodavidsonian) eventuality variables, nominal references, sense tagging, and connections to the Penn Discourse Treebank (PDTB), a project for annotating discourse connectives and their arguments.",
            "cx": 3354.6,
            "cy": -1193.49,
            "rx": 103.476,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W04-0212",
            "name": "Annotation and Data Mining of the {P}enn {D}iscourse {T}ree{B}ank",
            "publication_data": 2004,
            "citation": 33,
            "abstract": "The Penn Discourse TreeBank (PDTB) is a new resource built on top of the Penn Wall Street Journal corpus, in which discourse connectives are annotated along with their arguments. Its use of standoff annotation allows integration with a stand-off version of the Penn TreeBank (syntactic structure) and PropBank (verbs and their arguments), which adds value for both linguistic discovery and discourse modeling. Here we describe the PDTB and some experiments in linguistic discovery based on the PDTB alone, as well as on the linked PTB and PDTB corpora.",
            "cx": 3095.6,
            "cy": -1193.49,
            "rx": 100.318,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W05-0305",
            "name": "Attribution and the (Non-)Alignment of Syntactic and Discourse Arguments of Connectives",
            "publication_data": 2005,
            "citation": 56,
            "abstract": "The annotations of the Penn Discourse Treebank (PDTB) include (1) discourse connectives and their arguments, and (2) attribution of each argument of each connective and of the relation it denotes. Because the PDTB covers the same text as the Penn TreeBank WSJ corpus, syntactic and discourse annotation can be compared. This has revealed significant differences between syntactic structure and discourse structure, in terms of the arguments of connectives, due in large part to attribution. We describe these differences, an algorithm for detecting them, and finally some experimental results. These results have implications for automating discourse annotation based on syntactic annotation.",
            "cx": 3303.6,
            "cy": -1103.75,
            "rx": 94.0904,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "prasad-etal-2008-penn",
            "name": "The {P}enn {D}iscourse {T}ree{B}ank 2.0.",
            "publication_data": 2008,
            "citation": 680,
            "abstract": "We present the second version of the Penn Discourse Treebank, PDTB-2.0, describing its lexically-grounded annotations of discourse relations and their two abstract object arguments over the 1 million word Wall Street Journal corpus. We describe all aspects of the annotation, including (a) the argument structure of discourse relations, (b) the sense annotation of the relations, and (c) the attribution of discourse relations and each of their arguments. We list the differences between PDTB-1.0 and PDTB-2.0. We present representative statistics for several aspects of the annotation in the corpus.",
            "cx": 2835.6,
            "cy": -834.531,
            "rx": 72.25,
            "ry": 26.7407,
            "stroke": "red",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "W98-0119",
            "name": "Partial proof trees and structural modalities",
            "publication_data": 1998,
            "citation": 1,
            "abstract": "None",
            "cx": 3787.6,
            "cy": -1642.19,
            "rx": 84.2917,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2000",
            "citation_count": 92,
            "name": 92,
            "cx": 28.5975,
            "cy": -1462.71,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2001",
            "citation_count": 3,
            "name": 3,
            "cx": 28.5975,
            "cy": -1372.97,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W00-2015",
            "name": "Relationship between strong and weak generative power of formal systems",
            "publication_data": 2000,
            "citation": 12,
            "abstract": "None",
            "cx": 3811.6,
            "cy": -1462.71,
            "rx": 108.375,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W00-1605",
            "name": "Some Experiments on Indicators of Parsing Complexity for Lexicalized Grammars",
            "publication_data": 2000,
            "citation": 27,
            "abstract": "In this paper, we identify syntactic lexical ambiguity and sentence complexity as factors that contribute to parsing complexity in fully lexicalized grammar formalisms such as Lexicalized Tree Adjoining Grammars. We also report on experiments that explore the effects of these factors on parsing complexity. We discuss how these constraints can be exploited in improving efficiency of parsers for such grammar formalisms.",
            "cx": 4016.6,
            "cy": -1462.71,
            "rx": 78.4777,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W00-1208",
            "name": "Comparing Lexicalized Treebank Grammars Extracted from {C}hinese, {K}orean, and {E}nglish Corpora",
            "publication_data": 2000,
            "citation": 9,
            "abstract": "In this paper, we present a method for comparing Lexicalized Tree Adjoining Grammars extracted from annotated corpora for three languages: English, Chinese and Korean. This method makes it possible to do a quantitative comparison between the syntactic structures of each language, thereby providing a way of testing the Universal Grammar Hypothesis, the foundation of modern linguistic theories.",
            "cx": 2007.6,
            "cy": -1462.71,
            "rx": 84.2917,
            "ry": 26.7407,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2003",
            "citation_count": 328,
            "name": 328,
            "cx": 28.5975,
            "cy": -1283.23,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W01-1803",
            "name": "The {XTAG} Project at {P}enn",
            "publication_data": 2001,
            "citation": 3,
            "abstract": "None",
            "cx": 3778.6,
            "cy": -1372.97,
            "rx": 74.9067,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2004",
            "citation_count": 281,
            "name": 281,
            "cx": 28.5975,
            "cy": -1193.49,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W03-1012",
            "name": "Using {LTAG} Based Features in Parse Reranking",
            "publication_data": 2003,
            "citation": 53,
            "abstract": "We propose the use of Lexicalized Tree Adjoining Grammar (LTAG) as a source of features that are useful for reranking the output of a statistical parser. In this paper, we extend the notion of a tree kernel over arbitrary sub-trees of the parse to the derivation trees and derived trees provided by the LTAG formalism, and in addition, we extend the original definition of the tree kernel, making it more lexicalized and more compact. We use LTAG based features for the parse reranking task and obtain labeled recall and precision of 89.7%/90.0% on WSJ section 23 of Penn Treebank for sentences of length xe2x89xa4 100 words. Our results show that the use of LTAG based tree kernel gives rise to a 17% relative difference in f-score improvement over the use of a linear kernel without LTAG based features.",
            "cx": 3909.6,
            "cy": -1283.23,
            "rx": 70.0071,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W03-0402",
            "name": "An {SVM}-based voting algorithm with application to parse reranking",
            "publication_data": 2003,
            "citation": 52,
            "abstract": "This paper introduces a novel Support Vector Machines (SVMs) based voting algorithm for reranking, which provides a way to solve the sequential models indirectly. We have presented a risk formulation under the PAC framework for this voting algorithm. We have applied this algorithm to the parse reranking problem, and achieved labeled recall and precision of 89.4%/89.8% on WSJ section 23 of Penn Treebank.",
            "cx": 3762.6,
            "cy": -1283.23,
            "rx": 58.8803,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "miltsakaki-etal-2004-penn",
            "name": "The {P}enn {D}iscourse {T}reebank",
            "publication_data": 2004,
            "citation": 161,
            "abstract": "This paper describes a new discourse-level annotation project xe2x80x93 the Penn Discourse Treebank (PDTB) xe2x80x93 that aims to produce a large-scale corpus in which discourse connectives are annotated, along with their arguments, thus exposing a clearly defined level of discourse structure. The PDTB is being built directly on top of the Penn Treebank and Propbank, thus supporting the extraction of useful syntactic and semantic features and providing a richer substrate for the development and evaluation of practical algorithms. We present a preliminary analysis of inter-annotator agreement xe2x80x93 both the level of agreement and the types of inter-annotator variation.",
            "cx": 2875.6,
            "cy": -1193.49,
            "rx": 63.7795,
            "ry": 26.7407,
            "stroke": "red",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "W06-0305",
            "name": "Annotating Attribution in the {P}enn {D}iscourse {T}ree{B}ank",
            "publication_data": 2006,
            "citation": 22,
            "abstract": "An emerging task in text understanding and generation is to categorize information as fact or opinion and to further attribute it to the appropriate source. Corpus annotation schemes aim to encode such distinctions for NLP applications concerned with such tasks, such as information extraction, question answering, summarization, and generation. We describe an annotation scheme for marking the attribution of abstract objects such as propositions, facts and eventualities associated with discourse relations and their arguments annotated in the Penn Discourse TreeBank. The scheme aims to capture the source and degrees of factuality of the abstract objects. Key aspects of the scheme are annotation of the text spans signalling the attribution, and annotation of features recording the source, type, scopal polarity, and determinacy of attribution.",
            "cx": 2835.6,
            "cy": -1014.01,
            "rx": 99.9045,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "I08-7010",
            "name": "Towards an Annotated Corpus of Discourse Relations in {H}indi",
            "publication_data": 2008,
            "citation": 16,
            "abstract": "We describe our initial efforts towards developing a large-scale corpus of Hindi texts annotated with discourse relations. Adopting the lexically grounded approach of the Penn Discourse Treebank (PDTB), we present a preliminary analysis of discourse connectives in a small corpus. We describe how discourse connectives are represented in the sentence-level dependency annotation in Hindi, and discuss how the discourse annotation can enrich this level for research and applications. The ultimate goal of our work is to build a Hindi Discourse Relation Bank along the lines of the PDTB. Our work will also contribute to the cross-linguistic understanding of discourse connectives.",
            "cx": 2255.6,
            "cy": -834.531,
            "rx": 92.7622,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "2005",
            "citation_count": 153,
            "name": 153,
            "cx": 28.5975,
            "cy": -1103.75,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W08-0614",
            "name": "A Pilot Annotation to Investigate Discourse Connectivity in Biomedical Text",
            "publication_data": 2008,
            "citation": 3,
            "abstract": "The goal of the Penn Discourse Treebank (PDTB) project is to develop a large-scale corpus, annotated with coherence relations marked by discourse connectives. Currently, the primary application of the PDTB annotation has been to news articles. In this study, we tested whether the PDTB guidelines can be adapted to a different genre. We annotated discourse connectives and their arguments in one 4,937-token full-text biomedical article. Two linguist annotators showed an agreement of 85% after simple conventions were added. For the remaining 15% cases, we found that biomedical domain-specific knowledge is needed to capture the linguistic cues that can be used to resolve inter-annotator disagreement. We found that the two annotators were able to reach an agreement after discussion. Thus our experiments suggest that the PDTB annotation can be adapted to new domains by minimally adjusting the guidelines and by adding some further domain-specific linguistic cues.",
            "cx": 2982.6,
            "cy": -834.531,
            "rx": 57.0522,
            "ry": 26.7407,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "kolachina-etal-2012-evaluation",
            "name": "Evaluation of Discourse Relation Annotation in the {H}indi Discourse Relation Bank",
            "publication_data": 2012,
            "citation": 10,
            "abstract": "We describe our experiments on evaluating recently proposed modifications to the discourse relation annotation scheme of the Penn Discourse Treebank (PDTB), in the context of annotating discourse relations in Hindi Discourse Relation Bank (HDRB). While the proposed modifications were driven by the desire to introduce greater conceptual clarity in the PDTB scheme and to facilitate better annotation quality, our findings indicate that overall, some of the changes render the annotation task much more difficult for the annotators, as also reflected in lower inter-annotator agreement for the relevant sub-tasks. Our study emphasizes the importance of best practices in annotation task design and guidelines, given that a major goal of an annotation effort should be to achieve maximally high agreement between annotators. Based on our study, we suggest modifications to the current version of the HDRB, to be incorporated in our future annotation work.",
            "cx": 2390.6,
            "cy": -475.571,
            "rx": 102.561,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "J14-4007",
            "name": "Reflections on the {P}enn {D}iscourse {T}ree{B}ank, Comparable Corpora, and Complementary Annotation",
            "publication_data": 2014,
            "citation": 38,
            "abstract": "The Penn Discourse Treebank (PDTB) was released to the public in 2008. It remains the largest manually annotated corpus of discourse relations to date. Its focus on discourse relations that are either lexically-grounded in explicit discourse connectives or associated with sentential adjacency has not only facilitated its use in language technology and psycholinguistics but also has spawned the annotation of comparable corpora in other languages and genres.n n Given this situation, this paper has four aims: (1) to provide a comprehensive introduction to the PDTB for those who are unfamiliar with it; (2) to correct some wrong (or perhaps inadvertent) assumptions about the PDTB and its annotation that may have weakened previous results or the performance of decision procedures induced from the data; (3) to explain variations seen in the annotation of comparable resources in other languages and genres, which should allow developers of future comparable resources to recognize whether the variations are relevant to them; and (4) to enumerate and explain relationships between PDTB annotation and complementary annotation of other linguistic phenomena. The paper draws on work done by ourselves and others since the corpus was released.",
            "cx": 2627.6,
            "cy": -296.09,
            "rx": 101.233,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W10-4310",
            "name": "Using entity features to classify implicit discourse relations",
            "publication_data": 2010,
            "citation": 46,
            "abstract": "We report results on predicting the sense of implicit discourse relations between adjacent sentences in text. Our investigation concentrates on the association between discourse relations and properties of the referring expressions that appear in the related sentences. The properties of interest include coreference information, grammatical role, information status and syntactic form of referring expressions. Predicting the sense of implicit discourse relations based on these features is considerably better than a random baseline and several of the most discriminative features conform with linguistic intuitions. However, these features do not perform as well as lexical features traditionally used for sense prediction.",
            "cx": 3142.6,
            "cy": -655.051,
            "rx": 73.5782,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "C10-2118",
            "name": "Realization of Discourse Relations by Other Means: Alternative Lexicalizations",
            "publication_data": 2010,
            "citation": 52,
            "abstract": "Studies of discourse relations have not, in the past, attempted to characterize what serves as evidence for them, beyond lists of frozen expressions, or markers, drawn from a few well-defined syntactic classes. In this paper, we describe how the lexicalized discourse relation annotations of the Penn Discourse Treebank (PDTB) led to the discovery of a wide range of additional expressions, annotated as AltLex (alternative lexicalizations) in the PDTB 2.0. Further analysis of AltLex annotation suggests that the set of markers is open-ended, and drawn from a wider variety of syntactic types than currently assumed. As a first attempt towards automatically identifying discourse relation markers, we propose the use of syntactic paraphrase methods.",
            "cx": 2836.6,
            "cy": -655.051,
            "rx": 99.9045,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "2006",
            "citation_count": 300,
            "name": 300,
            "cx": 28.5975,
            "cy": -1014.01,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W15-2707",
            "name": "Bridging Sentential and Discourse-level Semantics through Clausal Adjuncts",
            "publication_data": 2015,
            "citation": 2,
            "abstract": "It is in PropBankxe2x80x99s ARGM annotation of clausal adjuncts that sentential semantics meets discourse relation annotation in the Penn Discourse TreeBank. This paper discusses complementarities between the two annotation systems: How PropBank ARGM annotation can be used to seed annotation of additional discourse relations in the PDTB, and how PDTB annotation can be used to refine or enrich PropBank ARGM annotation.",
            "cx": 2712.6,
            "cy": -206.35,
            "rx": 90.5193,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "I05-1049",
            "name": "Relative Compositionality of Multi-word Expressions: A Study of Verb-Noun ({V}-N) Collocations",
            "publication_data": 2005,
            "citation": 9,
            "abstract": "Recognition of Multi-word Expressions (MWEs) and their relative compositionality are crucial to Natural Language Processing. Various statistical techniques have been proposed to recognize MWEs. In this paper, we integrate all the existing statistical features and investigate a range of classifiers for their suitability for recognizing the non-compositional Verb-Noun (V-N) collocations. In the task of ranking the V-N collocations based on their relative compositionality, we show that the correlation between the ranks computed by the classifier and human ranking is significantly better than the correlation between ranking of individual features and human ranking. We also show that the properties xe2x80x98Distributed frequency of object' (as defined in [27] ) and xe2x80x98Nearest Mutual Information' (as adapted from [18]) contribute greatly to the recognition of the non-compositional MWEs of the V-N type and to the ranking of the V-N collocations based on their relative compositionality.",
            "cx": 3789.6,
            "cy": -1103.75,
            "rx": 86.0347,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "H05-1113",
            "name": "Measuring the Relative Compositionality of Verb-Noun ({V}-N) Collocations by Integrating Features",
            "publication_data": 2005,
            "citation": 55,
            "abstract": "Measuring the relative compositionality of Multi-word Expressions (MWEs) is crucial to Natural Language Processing. Various collocation based measures have been proposed to compute the relative compositionality of MWEs. In this paper, we define novel measures (both collocation based and context based measures) to measure the relative compositionality of MWEs of V-N type. We show that the correlation of these features with the human ranking is much superior to the correlation of the traditional features with the human ranking. We then integrate the proposed features and the traditional features using a SVM based ranking function to rank the collocations of V-N type based on their relative compositionality. We then show that the correlation between the ranks computed by the SVM based ranking function and human ranking is significantly better than the correlation between ranking of individual features and human ranking.",
            "cx": 3989.6,
            "cy": -1103.75,
            "rx": 96.3333,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "P07-1096",
            "name": "Guided Learning for Bidirectional Sequence Classification",
            "publication_data": 2007,
            "citation": 136,
            "abstract": "In this paper, we propose guided learning, a new learning framework for bidirectional sequence classification. The tasks of learning the order of inference and training the local classifier are dynamically incorporated into a single Perceptron like learning algorithm. We apply this novel learning algorithm to POS tagging. It obtains an error rate of 2.67% on the standard PTB test set, which represents 3.3% relative error reduction over the previous best result on the same data set, while using fewer features.",
            "cx": 1363.6,
            "cy": -924.271,
            "rx": 76.2353,
            "ry": 26.7407,
            "stroke": "red",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "D08-1052",
            "name": "{LTAG} Dependency Parsing with Bidirectional Incremental Construction",
            "publication_data": 2008,
            "citation": 24,
            "abstract": "In this paper, we first introduce a new architecture for parsing, bidirectional incremental parsing. We propose a novel algorithm for incremental construction, which can be applied to many structure learning problems in NLP. We apply this algorithm to LTAG dependency parsing, and achieve significant improvement on accuracy over the previous best result on the same data set.",
            "cx": 1311.6,
            "cy": -834.531,
            "rx": 83.3772,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W06-1204",
            "name": "Using Information about Multi-word Expressions for the Word-Alignment Task",
            "publication_data": 2006,
            "citation": 22,
            "abstract": "It is well known that multi-word expressions are problematic in natural language processing. In previous literature, it has been suggested that information about their degree of compositionality can be helpful in various applications but it has not been proven empirically. In this paper, we propose a framework in which information about the multi-word expressions can be used in the word-alignment task. We have shown that even simple features like point-wise mutual information are useful for word-alignment task in English-Hindi parallel corpora. The alignment error rate which we achieve (AER = 0.5040) is significantly better (about 10% decrease in AER) than the alignment error rates of the state-of-art models (Och and Ney, 2003) (Best AER = 0.5518) on the English-Hindi dataset.",
            "cx": 3936.6,
            "cy": -1014.01,
            "rx": 77.5641,
            "ry": 26.7407,
            "stroke": "red",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "D07-1039",
            "name": "Detecting Compositionality of Verb-Object Combinations using Selectional Preferences",
            "publication_data": 2007,
            "citation": 35,
            "abstract": "In this paper we explore the use of selectional preferences for detecting noncompositional verb-object combinations. To characterise the arguments in a given grammatical relationship we experiment with three models of selectional preference. Two use WordNet and one uses the entries from a distributional thesaurus as classes for representation. In previous work on selectional preference acquisition, the classes used for representation are selected according to the coverage of argument tokens rather than being selected according to the coverage of argument types. In our distributional thesaurus models and one of the methods using WordNet we select classes for representing the preferences by virtue of the number of argument types that they cover, and then only tokens under these classes which are representative of the argument head data are used to estimate the probability distribution for the selectional preference model. We demonstrate a highly signicant correlation between measures which use these xe2x80x98typebasedxe2x80x99 selectional preferences and compositionality judgements from a data set used in previous research. The type-based models perform better than the models which use tokens for selecting the classes. Furthermore, the models which use the automatically acquired thesaurus entries produced the best results. The correlation for the thesaurus models is stronger than any of the individual features used in previous research on the same dataset.",
            "cx": 4042.6,
            "cy": -924.271,
            "rx": 88.2768,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "2007",
            "citation_count": 181,
            "name": 181,
            "cx": 28.5975,
            "cy": -924.271,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W06-3902",
            "name": "Extracting formal specifications from natural language regulatory documents",
            "publication_data": 2006,
            "citation": "???",
            "abstract": "None",
            "cx": 4161.6,
            "cy": -1014.01,
            "rx": 91.4341,
            "ry": 26.7407,
            "stroke": "red",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "W06-3601",
            "name": "A Syntax-Directed Translator with Extended Domain of Locality",
            "publication_data": 2006,
            "citation": 63,
            "abstract": "A syntax-directed translator first parses the source-language input into a parse-tree, and then recursively converts the tree into a string in the target-language. We model this conversion by an extended tree-to-string transducer that have multi-level trees on the source-side, which gives our system more expressive power and flexibility. We also define a direct probability model and use a linear-time dynamic programming algorithm to search for the best derivation. The model is then extended to the general log-linear framework in order to rescore with other features like n-gram language models. We devise a simple-yet-effective algorithm to generate non-duplicate k-best translations for n-gram rescoring. Initial experimental results on English-to-Chinese translation are presented.",
            "cx": 4326.6,
            "cy": -1014.01,
            "rx": 55.7232,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W06-1635",
            "name": "Protein folding and chart parsing",
            "publication_data": 2006,
            "citation": 1,
            "abstract": "How can proteins fold so quickly into their unique native structures? We show here that there is a natural analogy between parsing and the protein folding problem, and demonstrate that CKY can find the native structures of a simplified lattice model of proteins with high accuracy.",
            "cx": 4474.6,
            "cy": -1014.01,
            "rx": 74.4932,
            "ry": 26.7407,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W06-1503",
            "name": "The Metagrammar Goes Multilingual: A Cross-Linguistic Look at the V2-Phenomenon",
            "publication_data": 2006,
            "citation": 9,
            "abstract": "We present an initial investigation into the use of a metagrammar for explicitly sharing abstract grammatical specifications among languages. We define a single class hierarchy for a metagrammar which allows us to automatically generate grammars for different languages from a single compact metagrammar hierarchy. We use as our linguistic example the verb-second phenomenon, which shows considerable variation while retaining a basic property, namely the fact that the verb can appear in one of two positions in the clause.",
            "cx": 4650.6,
            "cy": -1014.01,
            "rx": 83.3772,
            "ry": 26.7407,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W10-4407",
            "name": "Unavoidable Ill-nestedness in Natural Language and the Adequacy of Tree Local-{MCTAG} Induced Dependency Structures",
            "publication_data": 2010,
            "citation": 9,
            "abstract": "None",
            "cx": 4722.6,
            "cy": -655.051,
            "rx": 96.7474,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2006.amta-papers.8",
            "name": "Statistical Syntax-Directed Translation with Extended Domain of Locality",
            "publication_data": 2006,
            "citation": 183,
            "abstract": "In syntax-directed translation, the source-language input is first parsed into a parse-tree, which is then recursively converted into a string in the target-language. We model this conversion by an extended tree-to-string transducer that has multi-level trees on the source-side, which gives our system more expressive power and flexibility. We also define a direct probability model and use a linear-time dynamic programming algorithm to search for the best derivation. The model is then extended to the general log-linear frame-work in order to incorporate other features like n-gram language models. We devise a simple-yet-effective algorithm to generate non-duplicate k-best translations for n-gram rescoring. Preliminary experiments on English-to-Chinese translation show a significant improvement in terms of translation quality compared to a state-of-the- art phrase-based system.",
            "cx": 4838.6,
            "cy": -1014.01,
            "rx": 86.0347,
            "ry": 26.7407,
            "stroke": "black",
            "width": "10",
            "dasharray": null
        },
        {
            "id": "2008",
            "citation_count": 808,
            "name": 808,
            "cx": 28.5975,
            "cy": -834.531,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W07-1201",
            "name": "Multi-Component {T}ree {A}djoining {G}rammars, Dependency Graph Models, and Linguistic Analyses",
            "publication_data": 2007,
            "citation": 3,
            "abstract": "Recent work identifies two properties that appear particularly relevant to the characterization of graph-based dependency models of syntactic structure: the absence of interleaving substructures (well-nestedness) and a bound on a type of discontinuity (gap-degree xe2x89xa4 1) successfully describe more than 99% of the structures in two dependency treebanks (Kuhlmann and Nivre 2006). Bodirsky et al. (2005) establish that every dependency structure with these two properties can be recast as a lexicalized Tree Adjoining Grammar (LTAG) derivation and vice versa. However, multi-component extensions of TAG (MC-TAG), argued to be necessary on linguistic grounds, induce dependency structures that do not conform to these two properties (Kuhlmann and Mohl 2006). In this paper, we observe that several types of MC-TAG as used for linguistic analysis are more restrictive than the formal system is in principle. In particular, tree-local MC-TAG, tree-local MC-TAG with flexible composition (Kallmeyer and Joshi 2003), and special cases of set-local TAG as used to describe certain linguistic phenomena satisfy the well-nested and gap degree xe2x89xa4 1 criteria. We also observe that gap degree can distinguish between prohibited and allowed wh-extractions in English, and report some preliminary work comparing the predictions of the graph approach and the MC-TAG approach to scrambling.",
            "cx": 4795.6,
            "cy": -924.271,
            "rx": 117.26,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W07-0407",
            "name": "Discriminative word alignment by learning the alignment structure and syntactic divergence between a language pair",
            "publication_data": 2007,
            "citation": 7,
            "abstract": "Discriminative approaches for word alignment have gained popularity in recent years because of the flexibility that they offer for using a large variety of features and combining information from various sources. But, the models proposed in the past have not been able to make much use of features that capture the likelihood of an alignment structure (the set of alignment links) and the syntactic divergence between sentences in the parallel text. This is primarily because of the limitation of their search techniques. In this paper, we propose a generic discriminative re-ranking approach for word alignment which allows us to make use of structural features effectively. These features are particularly useful for language pairs with high structural divergence (like English-Hindi, English-Japanese). We have shown that by using the structural features, we have obtained a decrease of 2.3% in the absolute value of alignment error rate (AER). When we add the cooccurence probabilities obtained from IBM model-4 to our features, we achieved the best AER (50.50) for the English-Hindi parallel corpus.",
            "cx": 5041.6,
            "cy": -924.271,
            "rx": 111.032,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2009",
            "citation_count": 32,
            "name": 32,
            "cx": 28.5975,
            "cy": -744.791,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "C08-2022",
            "name": "Easily Identifiable Discourse Relations",
            "publication_data": 2008,
            "citation": 82,
            "abstract": "We present a corpus study of local discourse relations based on the Penn Discourse Tree Bank, a large manually annotated corpus of explicitly or implicitly realized relations. We show that while there is a large degree of ambiguity in temporal explicit discourse connectives, overall connectives are mostly unambiguous and allow high-accuracy prediction of discourse relation type. We achieve 93.09% accuracy in classifying the explicit relations and 74.74% accuracy overall. In addition, we show that some pairs of relations occur together in text more often than expected by chance. This finding suggests that global sequence classification of the relations in text can lead to better results, especially for implicit relations.",
            "cx": 3284.6,
            "cy": -834.531,
            "rx": 74.9067,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W09-3029",
            "name": "The {H}indi Discourse Relation Bank",
            "publication_data": 2009,
            "citation": 32,
            "abstract": "We describe the Hindi Discourse Relation Bank project, aimed at developing a large corpus annotated with discourse relations. We adopt the lexically grounded approach of the Penn Discourse Treebank, and describe our classification of Hindi discourse connectives, our modifications to the sense classification of discourse relations, and some cross-linguistic comparisons based on some initial annotations carried out so far.",
            "cx": 2271.6,
            "cy": -744.791,
            "rx": 74.4932,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W10-4327",
            "name": "Discourse indicators for content selection in summarization",
            "publication_data": 2010,
            "citation": 90,
            "abstract": "We present analyses aimed at eliciting which specific aspects of discourse provide the strongest indication for text importance. In the context of content selection for single document summarization of news, we examine the benefits of both the graph structure of text provided by discourse relations and the semantic sense of these relations. We find that structure information is the most robust indicator of importance. Semantic sense only provides constraints on content selection but is not indicative of important content by itself. However, sense features complement structure information and lead to improved performance. Further, both types of discourse information prove complementary to non-discourse features. While our results establish the usefulness of discourse features, we also find that lexical overlap provides a simple and cheap alternative to discourse for computing text structure with comparable performance for the task of content selection.",
            "cx": 2589.6,
            "cy": -655.051,
            "rx": 90.5193,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "tonelli-etal-2010-annotation",
            "name": "Annotation of Discourse Relations for Conversational Spoken Dialogs",
            "publication_data": 2010,
            "citation": 33,
            "abstract": "In this paper, we make a qualitative and quantitative analysis of discourse relations within the LUNA conversational spoken dialog corpus. In particular, we first describe the Penn Discourse Treebank (PDTB) and then we detail the adaptation of its annotation scheme to the LUNA corpus of Italian task-oriented dialogs in the domain of software/hardware assistance. We discuss similarities and differences between our approach and the PDTB paradigm and point out the peculiarities of spontaneous dialogs w.r.t. written text, which motivated some changes in the annotation strategy. In particular, we introduced the annotation of relations between non-contiguous arguments and we modified the sense hierarchy in order to take into account the important role of pragmatics in dialogs. In the final part of the paper, we present a comparison between the sense and connective frequency in a representative subset of the LUNA corpus and in the PDTB. Such analysis confirmed the differences between the two corpora and corroborates our choice to introduce dialog-specific adaptations.",
            "cx": 2390.6,
            "cy": -655.051,
            "rx": 90.5193,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "W16-1704",
            "name": "A Discourse-Annotated Corpus of Conjoined {VP}s",
            "publication_data": 2016,
            "citation": 12,
            "abstract": "English grammars indicate a variety of relations holding between conjoined VPs. VPs conjoined by and evince such senses as Result, Temporal Sequence and Concession. Although all these senses are ones associated with discourse relations, conjoined VPs have not been fully included in discourse annotation. Because of the value of discourse-annotated corpora for developing approaches to automated sense recognition, we have added their annotation to the Penn Discourse TreeBank. This paper describes how tokens were identified; how the process of span and sense annotation was modified and extended in order to keep the annotation of intra-sentential multi-clausal structures consistent with the rest of the corpus; and what the resulting corpus looks like, in terms of token frequency and common sense patterns.",
            "cx": 2831.6,
            "cy": -116.61,
            "rx": 64.1938,
            "ry": 26.7407,
            "stroke": "black",
            "width": "3",
            "dasharray": null
        },
        {
            "id": "C16-2026",
            "name": "Annotating Discourse Relations with the {PDTB} Annotator",
            "publication_data": 2016,
            "citation": 2,
            "abstract": "The PDTB Annotator is a tool for annotating and adjudicating discourse relations based on the annotation framework of the Penn Discourse TreeBank (PDTB). This demo describes the benefits of using the PDTB Annotator, gives an overview of the PDTB Framework and discusses the tool{'}s features, setup requirements and how it can also be used for adjudication.",
            "cx": 3002.6,
            "cy": -116.61,
            "rx": 89.191,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2010",
            "citation_count": 266,
            "name": 266,
            "cx": 28.5975,
            "cy": -655.051,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2011",
            "citation_count": 7,
            "name": 7,
            "cx": 28.5975,
            "cy": -565.311,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W10-3809",
            "name": "A Discriminative Approach for Dependency Based Statistical Machine Translation",
            "publication_data": 2010,
            "citation": 4,
            "abstract": "In this paper, we propose a dependency based statistical system that uses discriminative techniques to train its parameters. We conducted experiments on an EnglishHindi parallel corpora. The use of syntax (dependency tree) allows us to address the large word-reorderings between English and Hindi. And, discriminative training allows us to use rich feature sets, including linguistic features that are useful in the machine translation task. We present results of the experimental implementation of the system in this paper.",
            "cx": 4899.6,
            "cy": -655.051,
            "rx": 62.4516,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W10-3714",
            "name": "Multiword Expressions as Discourse Relation Markers ({DRM}s)",
            "publication_data": 2010,
            "citation": 2,
            "abstract": "Usually, by Multi-Word Expressions (MWEs) we mean expressions whose structure and meaning cannot be derived from their component words as they occur independently. In this talk I will discuss a different kind of multi-word expressions that behave as discourse relation markers (DRMs), yet do not seem to belong to well-defined syntactic classes. The apparent open-endedness of these expressions is a challenge for their automatic identification.1",
            "cx": 5080.6,
            "cy": -655.051,
            "rx": 100.318,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2012",
            "citation_count": 28,
            "name": 28,
            "cx": 28.5975,
            "cy": -475.571,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W11-0806",
            "name": "Tree-Rewriting Models of Multi-Word Expressions",
            "publication_data": 2011,
            "citation": 7,
            "abstract": "Multi-word expressions (MWEs) account for a large portion of the language used in day-to-day interactions. A formal system that is flexible enough to model these large and often syntactically-rich non-compositional chunks as single units in naturally occurring text could considerably simplify large-scale semantic annotation projects, in which it would be undesirable to have to develop internal compositional analyses of common technical expressions that have specific idiosyncratic meanings. This paper will first define a notion of functor-argument decomposition on phrase structure trees analogous to graph coloring, in which the tree is cast as a graph, and the elementary structures of a grammar formalism are colors. The paper then presents a formal argument that tree-rewriting systems, a class of grammar formalism that includes Tree Adjoining Grammars, are able to produce a proper superset of the functor-argument decompositions that string-rewriting systems can produce.",
            "cx": 3782.6,
            "cy": -565.311,
            "rx": 116.845,
            "ry": 26.7407,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "D11-1111",
            "name": "Computing Logical Form on Regulatory Texts",
            "publication_data": 2011,
            "citation": 0,
            "abstract": "The computation of logical form has been proposed as an intermediate step in the translation of sentences to logic. Logical form encodes the resolution of scope ambiguities. In this paper, we describe experiments on a modest-sized corpus of regulation annotated with a novel variant of logical form, called abstract syntax trees (ASTs). The main step in computing ASTs is to order scope-taking operators. A learning model for ranking is adapted fortius ordering. We design features by studying the problem of comparing the scope of one operator to another. The scope comparisons are used to compute ASTs, with an F-score of 90.6% on the set of ordering decisons.",
            "cx": 4012.6,
            "cy": -565.311,
            "rx": 95.4188,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2013",
            "citation_count": 0,
            "name": 0,
            "cx": 28.5975,
            "cy": -385.831,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W12-4601",
            "name": "Delayed Tree-Locality, Set-locality, and Clitic Climbing",
            "publication_data": 2012,
            "citation": 0,
            "abstract": "Since Bleam's (2000) initial claim that capturing clitic climbing patterns in Romance requires the descriptive power of set-local MCTAG (Weir, 1988), alternative approaches to relaxing tree-locality restrictions have been developed, including delayed tree-local MCTAG (Chiang and Scheffler, 2008), which, unlike set-local MCTAG, is weakly equivalent to standard TAG. This paper compares 2-delayed treelocal MCTAG with set-local MCTAG in terms of how well the two formalisms can account for the clitic climbing data. We confirm that 2-delay tree-local MCTAG has the formal expressivity to cover the data by proposing an explicit grammar to do so. However, we also find that the constraint on set locality is particularly well-suited for capturing these clitic climbing patterns. I.e., though globally less restrictive, set-local MCTAG appears to be restrictive in just the right way in this specific case.",
            "cx": 3744.6,
            "cy": -475.571,
            "rx": 79.3924,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2014",
            "citation_count": 38,
            "name": 38,
            "cx": 28.5975,
            "cy": -296.09,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W13-3702",
            "name": "Invited talk: Dependency Representations, Grammars, Folded Structures, among Other Things!",
            "publication_data": 2013,
            "citation": 0,
            "abstract": "None",
            "cx": 3751.6,
            "cy": -385.831,
            "rx": 86.0347,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2015",
            "citation_count": 2,
            "name": 2,
            "cx": 28.5975,
            "cy": -206.35,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "W14-5101",
            "name": "Keynote Lecture 1: Complexity of Dependency Representations for Natural Languages",
            "publication_data": 2014,
            "citation": 0,
            "abstract": "None",
            "cx": 3758.6,
            "cy": -296.09,
            "rx": 92.7622,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2016",
            "citation_count": 14,
            "name": 14,
            "cx": 28.5975,
            "cy": -116.61,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "J15-4009",
            "name": "{O}bituaries: Jane {J}. Robinson",
            "publication_data": 2015,
            "citation": "???",
            "abstract": "None",
            "cx": 3142.6,
            "cy": -206.35,
            "rx": 112.36,
            "ry": 26.7407,
            "stroke": "black",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "2017",
            "citation_count": 0,
            "name": 0,
            "cx": 28.5975,
            "cy": -26.8701,
            "rx": 28.6953,
            "ry": 18.0,
            "stroke": "black",
            "width": 1,
            "dasharray": null
        },
        {
            "id": "2017.lilt-15.1",
            "name": "Lexical Factorization and Syntactic Behavior",
            "publication_data": 2017,
            "citation": "???",
            "abstract": "In this paper, we examine the correlation between lexical semantics and the syntactic realization of the different components of a word{'}s meaning in natural language. More specifically, we will explore the effect that lexical factorization in verb semantics has on the suppression or expression of semantic features within the sentence. Factorization was a common analytic tool employed in early generative linguistic approaches to lexical decomposition, and continues to play a role in contemporary semantics, in various guises and modified forms. Building on the unpublished analysis of verbs of seeing in Joshi (1972), we argue here that the significance of lexical factorization is twofold: first, current models of verb meaning owe much of their insight to factor-based theories of meaning; secondly, the factorization properties of a lexical item appear to influence, both directly and indirectly, the possible syntactic expressibility of arguments and adjuncts in sentence composition. We argue that this information can be used to compute what we call the factor expression likelihood (FEL) associated with a verb in a sentence. This is the likelihood that the overt syntactic expression of a factor will cooccur with the verb. This has consequences for the compositional mechanisms responsible for computing the meaning of the sentence, as well as significance in the creation of computational models attempting to capture linguistic behavior over large corpora.",
            "cx": 396.597,
            "cy": -26.8701,
            "rx": 81.135,
            "ry": 26.7407,
            "stroke": "black",
            "width": null,
            "dasharray": "5,2"
        },
        {
            "id": "2017.lilt-15.2",
            "name": "Factorization of Verbs: An Analysis of Verbs of Seeing",
            "publication_data": 2017,
            "citation": 0,
            "abstract": "In 1972, I spent a year at the Institute for Advanced Study, Princeton, as a Guggenheim Fellow. I was invited to join a group of visitors, all interested in various aspects of language. George Miller was heading this group. The other visitors were Phil Johnson Laird, now at Princeton University and Pim Levelt, now at Max Plank Institute, Nijmegen, The Netherlands. It was truly a wonderful year. I was allowed to continue my research in Computational Linguistics and branch out in other directions of my choosing. I continued my work in Mathematical Linguistics, xe2x80x98testingxe2x80x99 it by explaining it to George, Phil, and Pim. These interactions allowed me to formulate a long term program in Mathematical Linguistics (ML). At the same time I was quite attracted by the work on Verbs of Motion that George and Phil had initiated. I thought it might be interesting to look at the Verbs of Seeing from this perspective. George encouraged me very strongly, always reminding me to follow an independent direction. The enclosed manuscript was finished in June 1972, a couple of months before I returned to Penn, where they roped me into the job of the Department Chair for Computer and Information Science at the University of Pennsylvania, a newly created Department. I was xe2x80x98stuckxe2x80x99 in this job for almost 12 years. Over the years, I have talked about this paper and the general topic of lexical decomposition but I never got around to write a long paper on this topic.",
            "cx": 186.597,
            "cy": -26.8701,
            "rx": 111.032,
            "ry": 26.7407,
            "stroke": "red",
            "width": 1,
            "dasharray": null
        }
    ],
    [
        {
            "source": "1967",
            "target": "1969",
            "d": "M28.5975,-3598.14C28.5975,-3582.78 28.5975,-3560.47 28.5975,-3545.1"
        },
        {
            "source": "C67-1007",
            "target": "C69-4701",
            "d": "M1101.6,-3589.15C1101.6,-3581.18 1101.6,-3572.29 1101.6,-3563.8"
        },
        {
            "source": "1969",
            "target": "1975",
            "d": "M28.5975,-3508.4C28.5975,-3493.04 28.5975,-3470.73 28.5975,-3455.36"
        },
        {
            "source": "C69-4701",
            "target": "C88-2121",
            "d": "M1129.13,-3500.71C1161.13,-3468.74 1209.6,-3410.11 1209.6,-3348.25 1209.6,-3348.25 1209.6,-3348.25 1209.6,-2628.33 1209.6,-2575.58 1236.69,-2519.77 1257.17,-2485.13"
        },
        {
            "source": "C69-4701",
            "target": "H89-2053",
            "d": "M1065.34,-3501.57C1024.45,-3471.1 963.597,-3414.61 963.597,-3348.25 963.597,-3348.25 963.597,-3348.25 963.597,-2538.59 963.597,-2487.96 946.516,-2431.52 933.639,-2396.17"
        },
        {
            "source": "C69-4701",
            "target": "H89-1036",
            "d": "M1101.6,-3499.57C1101.6,-3464.95 1101.6,-3402.02 1101.6,-3348.25 1101.6,-3348.25 1101.6,-3348.25 1101.6,-2538.59 1101.6,-2489.87 1101.6,-2433.61 1101.6,-2397.73"
        },
        {
            "source": "1975",
            "target": "1977",
            "d": "M28.5975,-3418.66C28.5975,-3403.3 28.5975,-3380.99 28.5975,-3365.62"
        },
        {
            "source": "1977",
            "target": "1978",
            "d": "M28.5975,-3328.92C28.5975,-3313.56 28.5975,-3291.25 28.5975,-3275.88"
        },
        {
            "source": "1978",
            "target": "1979",
            "d": "M28.5975,-3239.18C28.5975,-3223.82 28.5975,-3201.51 28.5975,-3186.14"
        },
        {
            "source": "1979",
            "target": "1980",
            "d": "M28.5975,-3149.44C28.5975,-3134.08 28.5975,-3111.76 28.5975,-3096.4"
        },
        {
            "source": "1980",
            "target": "1982",
            "d": "M28.5975,-3059.7C28.5975,-3044.34 28.5975,-3022.02 28.5975,-3006.66"
        },
        {
            "source": "1982",
            "target": "1983",
            "d": "M28.5975,-2969.96C28.5975,-2954.6 28.5975,-2932.28 28.5975,-2916.92"
        },
        {
            "source": "J82-1001",
            "target": "P83-1002",
            "d": "M3795.6,-2960.97C3795.6,-2953 3795.6,-2944.11 3795.6,-2935.62"
        },
        {
            "source": "C82-1066",
            "target": "C82-1066",
            "d": "M4275.4,-3004.76C4295.28,-3004.27 4310.74,-2998.78 4310.74,-2988.29 4310.74,-2979.69 4300.34,-2974.46 4285.62,-2972.58"
        },
        {
            "source": "1983",
            "target": "1984",
            "d": "M28.5975,-2880.22C28.5975,-2864.86 28.5975,-2842.54 28.5975,-2827.18"
        },
        {
            "source": "P83-1007",
            "target": "P84-1029",
            "d": "M3562.74,-2871.7C3556.36,-2862.96 3549.14,-2853.05 3542.37,-2843.77"
        },
        {
            "source": "P83-1007",
            "target": "J95-2003",
            "d": "M3604.76,-2872.18C3613.22,-2861.6 3622.06,-2848.75 3627.6,-2835.68 3647.93,-2787.75 3646.6,-2772.15 3646.6,-2720.07 3646.6,-2720.07 3646.6,-2720.07 3646.6,-2000.15 3646.6,-1951.43 3646.6,-1895.17 3646.6,-1859.29"
        },
        {
            "source": "1984",
            "target": "1985",
            "d": "M28.5975,-2790.48C28.5975,-2775.12 28.5975,-2752.8 28.5975,-2737.44"
        },
        {
            "source": "P84-1029",
            "target": "H86-1017",
            "d": "M3517.6,-2781.63C3517.6,-2751.13 3517.6,-2700.58 3517.6,-2666.39"
        },
        {
            "source": "1985",
            "target": "1986",
            "d": "M28.5975,-2700.74C28.5975,-2685.38 28.5975,-2663.06 28.5975,-2647.7"
        },
        {
            "source": "P85-1011",
            "target": "C86-1048",
            "d": "M599.454,-2693.87C583.847,-2683.41 565.437,-2671.08 549.008,-2660.08"
        },
        {
            "source": "P85-1011",
            "target": "P88-1032",
            "d": "M651.322,-2692.45C681.092,-2643.94 745.672,-2538.72 778.911,-2484.56"
        },
        {
            "source": "P85-1011",
            "target": "H05-1102",
            "d": "M635.597,-2691.91C635.597,-2657.29 635.597,-2594.36 635.597,-2540.59 635.597,-2540.59 635.597,-2540.59 635.597,-2089.89 635.597,-1966.42 711.597,-1946.15 711.597,-1822.67 711.597,-1822.67 711.597,-1822.67 711.597,-1282.23 711.597,-1193.78 791.456,-1199.44 873.597,-1166.62 982.721,-1123.03 1117.87,-1109.44 1208.96,-1105.57"
        },
        {
            "source": "1986",
            "target": "1987",
            "d": "M28.5975,-2611C28.5975,-2595.64 28.5975,-2573.32 28.5975,-2557.96"
        },
        {
            "source": "H86-1020",
            "target": "H05-1102",
            "d": "M2119.6,-2602.17C2119.6,-2567.55 2119.6,-2504.62 2119.6,-2450.85 2119.6,-2450.85 2119.6,-2450.85 2119.6,-1282.23 2119.6,-1139.44 1632.12,-1111.39 1414.44,-1105.99"
        },
        {
            "source": "C86-1048",
            "target": "T87-1011",
            "d": "M504.597,-2602.01C504.597,-2594.04 504.597,-2585.15 504.597,-2576.66"
        },
        {
            "source": "C86-1048",
            "target": "P88-1034",
            "d": "M446.451,-2607.84C426.648,-2598.16 406.12,-2584.64 392.597,-2566.46 375.547,-2543.54 369.645,-2511.39 367.81,-2486.81"
        },
        {
            "source": "1987",
            "target": "1988",
            "d": "M28.5975,-2521.26C28.5975,-2505.9 28.5975,-2483.58 28.5975,-2468.21"
        },
        {
            "source": "P87-1015",
            "target": "P88-1034",
            "d": "M254.331,-2514.15C273.372,-2503.51 295.833,-2490.96 315.711,-2479.85"
        },
        {
            "source": "P87-1015",
            "target": "P89-1027",
            "d": "M212.363,-2512.38C215.331,-2486.94 223.285,-2448.52 244.597,-2422.98 258.022,-2406.9 276.674,-2394.57 295.399,-2385.32"
        },
        {
            "source": "1988",
            "target": "1989",
            "d": "M28.5975,-2431.52C28.5975,-2416.16 28.5975,-2393.84 28.5975,-2378.47"
        },
        {
            "source": "P88-1032",
            "target": "C88-2121",
            "d": "M860.535,-2449.85C970.727,-2449.85 1080.92,-2449.85 1191.11,-2449.85"
        },
        {
            "source": "P88-1032",
            "target": "P89-1027",
            "d": "M744.884,-2437.74C671.867,-2422.91 541.719,-2396.48 455.021,-2378.87"
        },
        {
            "source": "P88-1032",
            "target": "H89-2053",
            "d": "M830.189,-2426.49C845.209,-2415.5 863.494,-2402.13 879.607,-2390.35"
        },
        {
            "source": "P88-1032",
            "target": "H89-1036",
            "d": "M849.467,-2434.36C898.065,-2420.25 972.529,-2398.61 1027.95,-2382.51"
        },
        {
            "source": "P88-1032",
            "target": "C96-2103",
            "d": "M751.15,-2433.54C729.174,-2423.9 705.304,-2409.01 692.597,-2386.98 680.662,-2366.29 677.665,-2351.88 692.597,-2333.24 738.44,-2276.02 796.216,-2342.89 853.597,-2297.24 928.207,-2237.89 915.597,-2187.23 915.597,-2091.89 915.597,-2091.89 915.597,-2091.89 915.597,-1910.41 915.597,-1786.7 1078.54,-1748.67 1195.38,-1737.31"
        },
        {
            "source": "P88-1034",
            "target": "P89-1027",
            "d": "M367.597,-2422.53C367.597,-2414.56 367.597,-2405.67 367.597,-2397.18"
        },
        {
            "source": "C88-2121",
            "target": "H89-2053",
            "d": "M1212.69,-2435.94C1155.69,-2424.49 1071.78,-2406.58 999.597,-2386.98 993.588,-2385.35 987.361,-2383.55 981.154,-2381.67"
        },
        {
            "source": "C88-2121",
            "target": "H89-1036",
            "d": "M1236.05,-2427.39C1212.04,-2415.55 1181.98,-2400.74 1156.39,-2388.12"
        },
        {
            "source": "C88-2121",
            "target": "H90-1010",
            "d": "M1300.21,-2423.8C1326.04,-2392.4 1370.37,-2338.5 1398.81,-2303.93"
        },
        {
            "source": "C88-2121",
            "target": "C90-3001",
            "d": "M1278.86,-2422.66C1278.11,-2399.21 1276.75,-2363.91 1274.6,-2333.24 1274.01,-2324.82 1273.22,-2315.78 1272.41,-2307.27"
        },
        {
            "source": "C88-2121",
            "target": "H91-1035",
            "d": "M1352.98,-2440.89C1428.35,-2431.42 1539.2,-2413.48 1572.6,-2386.98 1626.48,-2344.23 1651.53,-2264.13 1662.01,-2217.61"
        },
        {
            "source": "C88-2121",
            "target": "E91-1005",
            "d": "M1265.37,-2423.27C1248.24,-2393.24 1219.76,-2345.91 1203.6,-2333.24 1106.93,-2257.46 969.367,-2217.76 876.513,-2198.3"
        },
        {
            "source": "C88-2121",
            "target": "A92-1030",
            "d": "M1275.05,-2422.83C1269.68,-2397.89 1258.79,-2360.16 1238.6,-2333.24 1222.16,-2311.34 1201.08,-2321.61 1188.6,-2297.24 1158.59,-2238.66 1205.04,-2166.08 1238.74,-2124.77"
        },
        {
            "source": "C88-2121",
            "target": "C94-1024",
            "d": "M1351.62,-2439.53C1493.96,-2419.08 1797.6,-2364.53 1797.6,-2271.37 1797.6,-2271.37 1797.6,-2271.37 1797.6,-2089.89 1797.6,-2040.68 1804.91,-1984.22 1810.46,-1948.44"
        },
        {
            "source": "C88-2121",
            "target": "P95-1036",
            "d": "M1352.09,-2439.97C1418.31,-2430.36 1509.58,-2412.85 1534.6,-2386.98 1571.08,-2349.26 1558.6,-2323.85 1558.6,-2271.37 1558.6,-2271.37 1558.6,-2271.37 1558.6,-2000.15 1558.6,-1951.42 1558.22,-1895.17 1557.92,-1859.29"
        },
        {
            "source": "C88-2121",
            "target": "J99-2004",
            "d": "M1332.14,-2430C1385.79,-2407.59 1466.08,-2364.52 1501.6,-2297.24 1606.13,-2099.27 1411.9,-2012.15 1465.6,-1794.8 1485.29,-1715.08 1536.59,-1632.6 1567.63,-1587.69"
        },
        {
            "source": "1989",
            "target": "1990",
            "d": "M28.5975,-2341.78C28.5975,-2326.42 28.5975,-2304.1 28.5975,-2288.73"
        },
        {
            "source": "W89-0235",
            "target": "H89-2053",
            "d": "M829.965,-2360.11C832.62,-2360.11 835.275,-2360.11 837.93,-2360.11"
        },
        {
            "source": "1990",
            "target": "1991",
            "d": "M28.5975,-2252.04C28.5975,-2236.68 28.5975,-2214.36 28.5975,-2198.99"
        },
        {
            "source": "W90-0214",
            "target": "E91-1005",
            "d": "M775.597,-2243.05C775.597,-2235.08 775.597,-2226.19 775.597,-2217.7"
        },
        {
            "source": "C90-3001",
            "target": "H90-1010",
            "d": "M1340.04,-2270.37C1342.68,-2270.37 1345.31,-2270.37 1347.94,-2270.37"
        },
        {
            "source": "C90-3001",
            "target": "A92-1030",
            "d": "M1268.6,-2243.19C1268.6,-2212.69 1268.6,-2162.14 1268.6,-2127.94"
        },
        {
            "source": "1991",
            "target": "1992",
            "d": "M28.5975,-2162.3C28.5975,-2146.94 28.5975,-2124.62 28.5975,-2109.25"
        },
        {
            "source": "H91-1035",
            "target": "C96-2103",
            "d": "M1668.6,-2153.47C1668.6,-2118.85 1668.6,-2055.92 1668.6,-2002.15 1668.6,-2002.15 1668.6,-2002.15 1668.6,-1910.41 1668.6,-1858.34 1686.08,-1831.96 1649.6,-1794.8 1618.74,-1763.38 1511.04,-1747.62 1425.4,-1739.91"
        },
        {
            "source": "E91-1005",
            "target": "H05-1102",
            "d": "M787.943,-2153.84C803.037,-2119.88 826.597,-2057.94 826.597,-2002.15 826.597,-2002.15 826.597,-2002.15 826.597,-1282.23 826.597,-1199.1 1081.04,-1143.29 1221.34,-1118.83"
        },
        {
            "source": "E91-1005",
            "target": "W08-2302",
            "d": "M749.595,-2154.31C719.375,-2122.04 673.597,-2063.1 673.597,-2002.15 673.597,-2002.15 673.597,-2002.15 673.597,-1013.01 673.597,-964.284 673.597,-908.032 673.597,-872.146"
        },
        {
            "source": "1992",
            "target": "1993",
            "d": "M28.5975,-2072.56C28.5975,-2057.2 28.5975,-2034.88 28.5975,-2019.51"
        },
        {
            "source": "A92-1030",
            "target": "P95-1036",
            "d": "M1295.53,-2064.99C1348.36,-2016.14 1465.52,-1907.81 1523.6,-1854.11"
        },
        {
            "source": "1993",
            "target": "1994",
            "d": "M28.5975,-1982.82C28.5975,-1967.46 28.5975,-1945.14 28.5975,-1929.77"
        },
        {
            "source": "1994",
            "target": "1995",
            "d": "M28.5975,-1893.08C28.5975,-1877.72 28.5975,-1855.4 28.5975,-1840.03"
        },
        {
            "source": "C94-1024",
            "target": "P95-1036",
            "d": "M1752.24,-1888.61C1712.94,-1875.3 1662.8,-1858.31 1623.26,-1844.92"
        },
        {
            "source": "C94-1024",
            "target": "J99-2004",
            "d": "M1774.12,-1886.16C1758.97,-1875.99 1742.69,-1863.13 1730.6,-1848.54 1663.37,-1767.47 1620.92,-1648.19 1602.78,-1589.2"
        },
        {
            "source": "C94-1024",
            "target": "W00-1307",
            "d": "M1821.87,-1884.38C1828.38,-1849.89 1838.6,-1787.11 1838.6,-1732.93 1838.6,-1732.93 1838.6,-1732.93 1838.6,-1641.19 1838.6,-1591.83 1845.95,-1535.19 1851.51,-1499.44"
        },
        {
            "source": "C94-1024",
            "target": "P03-1064",
            "d": "M1792.69,-1885.06C1783.9,-1874.48 1774.63,-1861.63 1768.6,-1848.54 1746.61,-1800.89 1744.6,-1785.41 1744.6,-1732.93 1744.6,-1732.93 1744.6,-1732.93 1744.6,-1461.71 1744.6,-1404.69 1705.35,-1348.76 1676.53,-1315.38"
        },
        {
            "source": "C94-1024",
            "target": "H05-1102",
            "d": "M1808.45,-1884.55C1798.4,-1850.25 1782.6,-1787.68 1782.6,-1732.93 1782.6,-1732.93 1782.6,-1732.93 1782.6,-1282.23 1782.6,-1201.51 1537.29,-1144.86 1400.74,-1119.58"
        },
        {
            "source": "1995",
            "target": "1996",
            "d": "M28.5975,-1803.34C28.5975,-1787.98 28.5975,-1765.66 28.5975,-1750.29"
        },
        {
            "source": "J95-2003",
            "target": "prasad-etal-2010-exploiting",
            "d": "M3638.14,-1794.82C3616.64,-1726.75 3561.6,-1536.6 3561.6,-1373.97 3561.6,-1373.97 3561.6,-1373.97 3561.6,-833.531 3561.6,-778.962 3528.03,-723.703 3502.59,-689.668"
        },
        {
            "source": "J95-2003",
            "target": "W12-3205",
            "d": "M3653.54,-1794.73C3662.12,-1760.34 3675.6,-1697.67 3675.6,-1643.19 3675.6,-1643.19 3675.6,-1643.19 3675.6,-743.791 3675.6,-554.285 3402.71,-499.159 3247.82,-483.132"
        },
        {
            "source": "1996",
            "target": "1998",
            "d": "M28.5975,-1713.6C28.5975,-1698.24 28.5975,-1675.92 28.5975,-1660.55"
        },
        {
            "source": "C96-2103",
            "target": "W00-1307",
            "d": "M1322.16,-1705.02C1341.87,-1660.24 1388.8,-1569.01 1459.6,-1525.58 1515.67,-1491.18 1704.3,-1473.93 1800.35,-1467.2"
        },
        {
            "source": "C96-2103",
            "target": "H05-1102",
            "d": "M1311.6,-1704.77C1311.6,-1670.15 1311.6,-1607.22 1311.6,-1553.45 1311.6,-1553.45 1311.6,-1553.45 1311.6,-1282.23 1311.6,-1233.5 1311.6,-1177.25 1311.6,-1141.37"
        },
        {
            "source": "1998",
            "target": "1999",
            "d": "M28.5975,-1623.86C28.5975,-1608.5 28.5975,-1586.18 28.5975,-1570.81"
        },
        {
            "source": "W98-0315",
            "target": "P99-1006",
            "d": "M3119.25,-1618.37C3095.15,-1606.75 3065.68,-1592.54 3040.47,-1580.39"
        },
        {
            "source": "W98-0315",
            "target": "W00-1307",
            "d": "M3076.93,-1630.53C2973.82,-1618.25 2799.47,-1597.44 2649.6,-1579.32 2322.88,-1539.83 2231.43,-1578.56 1914.6,-1489.58 1910.24,-1488.36 1905.8,-1486.85 1901.4,-1485.18"
        },
        {
            "source": "W98-0315",
            "target": "W03-2608",
            "d": "M3156.63,-1615.23C3132.46,-1552.26 3070.68,-1391.29 3043.17,-1319.6"
        },
        {
            "source": "W98-0315",
            "target": "J03-4002",
            "d": "M3074.17,-1632.47C3000.5,-1623.57 2905.39,-1607.04 2878.6,-1579.32 2810.37,-1508.74 2813.9,-1382.01 2820.5,-1320.16"
        },
        {
            "source": "W98-0315",
            "target": "W04-2703",
            "d": "M3073.24,-1633.25C3006.53,-1625.26 2915.67,-1609.57 2840.6,-1579.32 2753.45,-1544.2 2663.6,-1557.67 2663.6,-1463.71 2663.6,-1463.71 2663.6,-1463.71 2663.6,-1371.97 2663.6,-1323.24 2663.98,-1266.99 2664.27,-1231.11"
        },
        {
            "source": "W98-0315",
            "target": "W04-2704",
            "d": "M3203.91,-1617.27C3245.98,-1587.05 3308.6,-1530.8 3308.6,-1463.71 3308.6,-1463.71 3308.6,-1463.71 3308.6,-1371.97 3308.6,-1321.35 3326.35,-1265.12 3339.8,-1229.79"
        },
        {
            "source": "W98-0315",
            "target": "W04-0212",
            "d": "M3170.48,-1615.31C3178.91,-1551.66 3194.47,-1383.45 3145.6,-1256.36 3141.61,-1246 3135.2,-1236.04 3128.28,-1227.26"
        },
        {
            "source": "W98-0315",
            "target": "W05-0305",
            "d": "M3255.46,-1630.13C3349.85,-1612.83 3485.6,-1569.55 3485.6,-1463.71 3485.6,-1463.71 3485.6,-1463.71 3485.6,-1282.23 3485.6,-1230.16 3499.56,-1206.93 3466.6,-1166.62 3448.26,-1144.19 3420.85,-1129.89 3393.71,-1120.77"
        },
        {
            "source": "W98-0315",
            "target": "prasad-etal-2008-penn",
            "d": "M3264.88,-1638.47C3323.36,-1632.56 3396.45,-1617.25 3450.6,-1579.32 3500.37,-1544.46 3523.6,-1524.48 3523.6,-1463.71 3523.6,-1463.71 3523.6,-1463.71 3523.6,-1282.23 3523.6,-994 3268.52,-1006.17 3001.6,-897.401 2967.01,-883.307 2927.88,-868.662 2896.31,-857.16"
        },
        {
            "source": "W98-0315",
            "target": "W12-3205",
            "d": "M3259.57,-1632.71C3342.85,-1623.51 3457.29,-1606.39 3493.6,-1579.32 3575.94,-1517.93 3599.6,-1476.68 3599.6,-1373.97 3599.6,-1373.97 3599.6,-1373.97 3599.6,-743.791 3599.6,-691.719 3618.35,-664.046 3580.6,-628.181 3528.56,-578.74 3322.65,-626.481 3259.6,-592.181 3232.48,-577.43 3237.16,-560.526 3215.6,-538.441 3205.41,-528.003 3193.65,-517.387 3182.64,-507.963"
        },
        {
            "source": "1999",
            "target": "2000",
            "d": "M28.5975,-1534.12C28.5975,-1518.76 28.5975,-1496.44 28.5975,-1481.07"
        },
        {
            "source": "P99-1006",
            "target": "J03-4002",
            "d": "M2969.35,-1525.83C2940.62,-1477.55 2878.46,-1373.07 2846.1,-1318.69"
        },
        {
            "source": "P99-1006",
            "target": "W04-2703",
            "d": "M2950.31,-1527.01C2895.89,-1486.84 2788.92,-1402.07 2720.6,-1310.1 2702.25,-1285.4 2687.41,-1253.74 2677.63,-1229.8"
        },
        {
            "source": "P99-1006",
            "target": "W04-0212",
            "d": "M3006.15,-1526.14C3040.09,-1484.41 3104.61,-1397.12 3128.6,-1310.1 3134.94,-1287.08 3134.39,-1279.53 3128.6,-1256.36 3126.28,-1247.08 3122.27,-1237.67 3117.84,-1229.08"
        },
        {
            "source": "P99-1006",
            "target": "W05-0305",
            "d": "M3023.22,-1527.57C3038.21,-1517.11 3054.81,-1503.94 3067.6,-1489.58 3176.19,-1367.68 3146.18,-1298.36 3242.6,-1166.62 3250.19,-1156.25 3259.49,-1145.93 3268.51,-1136.77"
        },
        {
            "source": "J99-2004",
            "target": "P03-1064",
            "d": "M1597.87,-1525.34C1607.6,-1477.23 1628.35,-1374.51 1639.38,-1319.97"
        },
        {
            "source": "2000",
            "target": "2001",
            "d": "M28.5975,-1444.38C28.5975,-1429.02 28.5975,-1406.7 28.5975,-1391.33"
        },
        {
            "source": "W00-1307",
            "target": "W00-1208",
            "d": "M1896.56,-1447.21C1910.52,-1443.61 1924.48,-1442.1 1938.44,-1442.68"
        },
        {
            "source": "W00-1208",
            "target": "W00-1307",
            "d": "M1948.61,-1481.95C1934.65,-1483.55 1920.69,-1483.05 1906.73,-1480.47"
        },
        {
            "source": "2001",
            "target": "2003",
            "d": "M28.5975,-1354.64C28.5975,-1339.28 28.5975,-1316.96 28.5975,-1301.59"
        },
        {
            "source": "2003",
            "target": "2004",
            "d": "M28.5975,-1264.9C28.5975,-1249.54 28.5975,-1227.22 28.5975,-1211.85"
        },
        {
            "source": "W03-2608",
            "target": "W04-2703",
            "d": "M2963.89,-1264.8C2952.79,-1261.93 2941.38,-1259.02 2930.6,-1256.36 2868.65,-1241.07 2798.32,-1224.75 2745.55,-1212.72"
        },
        {
            "source": "W03-2608",
            "target": "W04-0212",
            "d": "M3048.69,-1256.85C3055.4,-1247.93 3063.05,-1237.75 3070.2,-1228.25"
        },
        {
            "source": "W03-0402",
            "target": "W03-1012",
            "d": "M3821.45,-1283.23C3824.07,-1283.23 3826.68,-1283.23 3829.29,-1283.23"
        },
        {
            "source": "J03-4002",
            "target": "W03-2608",
            "d": "M2922.02,-1283.23C2924.5,-1283.23 2926.98,-1283.23 2929.47,-1283.23"
        },
        {
            "source": "J03-4002",
            "target": "W04-2703",
            "d": "M2782.88,-1258.95C2762.25,-1247.71 2737.35,-1234.14 2715.73,-1222.36"
        },
        {
            "source": "J03-4002",
            "target": "W04-0212",
            "d": "M2886.53,-1262.43C2927.3,-1249.18 2981.14,-1231.69 3023.97,-1217.77"
        },
        {
            "source": "J03-4002",
            "target": "miltsakaki-etal-2004-penn",
            "d": "M2840.33,-1256.38C2845.25,-1247.74 2850.82,-1237.96 2856.06,-1228.78"
        },
        {
            "source": "J03-4002",
            "target": "W05-0305",
            "d": "M2881.16,-1261.27C2903.62,-1251.1 2928.85,-1237.36 2948.6,-1220.36 2970.77,-1201.28 2961.86,-1182.23 2986.6,-1166.62 3066.31,-1116.32 3103.27,-1149.61 3195.6,-1130.62 3204.92,-1128.7 3214.66,-1126.57 3224.31,-1124.36"
        },
        {
            "source": "J03-4002",
            "target": "W06-0305",
            "d": "M2813.62,-1256.32C2809.22,-1245.46 2804.79,-1232.54 2802.6,-1220.36 2791.91,-1160.94 2809.26,-1091.53 2822.59,-1050.54"
        },
        {
            "source": "J03-4002",
            "target": "prasad-etal-2008-penn",
            "d": "M2735.04,-1274.02C2569.2,-1256.46 2233.6,-1208.16 2233.6,-1104.75 2233.6,-1104.75 2233.6,-1104.75 2233.6,-1013.01 2233.6,-905.417 2591.86,-858.206 2755.63,-842.245"
        },
        {
            "source": "J03-4002",
            "target": "I08-7010",
            "d": "M2730.58,-1278.63C2596.21,-1272.34 2358.36,-1256.38 2280.6,-1220.36 2212.52,-1188.83 2157.6,-1179.78 2157.6,-1104.75 2157.6,-1104.75 2157.6,-1104.75 2157.6,-1013.01 2157.6,-956.801 2195.73,-901.655 2224.43,-868.119"
        },
        {
            "source": "2004",
            "target": "2005",
            "d": "M28.5975,-1175.16C28.5975,-1159.8 28.5975,-1137.48 28.5975,-1122.11"
        },
        {
            "source": "W04-2703",
            "target": "W04-0212",
            "d": "M2720.59,-1214.85C2747.65,-1224.07 2780.85,-1233.77 2811.6,-1238.36 2867.86,-1246.76 2883.27,-1246.3 2939.6,-1238.36 2968.3,-1234.32 2999.13,-1226.28 3025.73,-1218.11"
        },
        {
            "source": "W04-2703",
            "target": "miltsakaki-etal-2004-penn",
            "d": "M2756.09,-1193.49C2771.13,-1193.49 2786.18,-1193.49 2801.22,-1193.49"
        },
        {
            "source": "W04-2703",
            "target": "W05-0305",
            "d": "M2738.58,-1177.74C2759.25,-1173.86 2781.76,-1169.86 2802.6,-1166.62 2942.21,-1144.94 3104.67,-1126.03 3205.83,-1115"
        },
        {
            "source": "W04-2703",
            "target": "W06-0305",
            "d": "M2687.98,-1167.29C2698.32,-1156.09 2710.61,-1142.74 2721.6,-1130.62 2743.11,-1106.9 2747.23,-1099.8 2769.6,-1076.88 2779.3,-1066.94 2790.18,-1056.48 2800.26,-1047.05"
        },
        {
            "source": "W04-2703",
            "target": "W08-0614",
            "d": "M2671.36,-1166.31C2684.98,-1114.25 2715.34,-1001.5 2726.6,-987.141 2755.03,-950.86 2868.24,-891.479 2934.2,-858.841"
        },
        {
            "source": "W04-2703",
            "target": "prasad-etal-2008-penn",
            "d": "M2663.39,-1166.42C2662.55,-1125.97 2665.15,-1046.57 2693.6,-987.141 2717.36,-937.513 2763.23,-893.189 2796.42,-865.474"
        },
        {
            "source": "W04-2703",
            "target": "kolachina-etal-2012-evaluation",
            "d": "M2598.31,-1175C2453.07,-1134.73 2119.6,-1030.78 2119.6,-925.271 2119.6,-925.271 2119.6,-925.271 2119.6,-743.791 2119.6,-626.408 2250.11,-543.255 2329.99,-503.353"
        },
        {
            "source": "W04-2703",
            "target": "J14-4007",
            "d": "M2573.82,-1190.84C2409.96,-1182.53 2081.6,-1139.18 2081.6,-925.271 2081.6,-925.271 2081.6,-925.271 2081.6,-474.571 2081.6,-408.066 2118.54,-391.406 2176.6,-358.96 2233.52,-327.147 2404.46,-310.64 2518.77,-302.925"
        },
        {
            "source": "W04-0212",
            "target": "W05-0305",
            "d": "M3147.82,-1170.46C3176.7,-1158.28 3212.74,-1143.08 3242.88,-1130.37"
        },
        {
            "source": "W04-0212",
            "target": "W06-0305",
            "d": "M3059.99,-1168.19C3013.06,-1136.15 2930.5,-1079.8 2879.68,-1045.1"
        },
        {
            "source": "miltsakaki-etal-2004-penn",
            "target": "W04-2704",
            "d": "M2918.14,-1213.65C2940.62,-1223.2 2969,-1233.55 2995.6,-1238.36 3097.5,-1256.79 3126.55,-1255.99 3228.6,-1238.36 3249.93,-1234.68 3272.44,-1227.72 3292.44,-1220.37"
        },
        {
            "source": "miltsakaki-etal-2004-penn",
            "target": "W05-0305",
            "d": "M2923.07,-1175.3C2933.06,-1172.09 2943.61,-1169 2953.6,-1166.62 3059.37,-1141.41 3088.84,-1151.31 3195.6,-1130.62 3205.18,-1128.76 3215.2,-1126.63 3225.1,-1124.4"
        },
        {
            "source": "miltsakaki-etal-2004-penn",
            "target": "W10-4310",
            "d": "M2922.29,-1174.98C2970.04,-1157.04 3037.41,-1131.63 3038.6,-1130.62 3083.86,-1092.17 3105.6,-1074.4 3105.6,-1015.01 3105.6,-1015.01 3105.6,-1015.01 3105.6,-923.271 3105.6,-839.801 3123.53,-743.039 3134.43,-691.947"
        },
        {
            "source": "miltsakaki-etal-2004-penn",
            "target": "C10-2118",
            "d": "M2921.1,-1174.29C2977.88,-1148.22 3067.6,-1094.45 3067.6,-1015.01 3067.6,-1015.01 3067.6,-1015.01 3067.6,-833.531 3067.6,-753.513 2979.36,-704.611 2911.96,-678.928"
        },
        {
            "source": "miltsakaki-etal-2004-penn",
            "target": "W12-3205",
            "d": "M2921.4,-1174.6C2929.1,-1171.8 2937.04,-1169.04 2944.6,-1166.62 3063.69,-1128.52 3181.6,-1140.05 3181.6,-1015.01 3181.6,-1015.01 3181.6,-1015.01 3181.6,-923.271 3181.6,-814.236 3214.91,-790.431 3225.6,-681.921 3227.94,-658.151 3236.28,-649.544 3225.6,-628.181 3213.67,-604.329 3192.8,-614.089 3177.6,-592.181 3161.11,-568.418 3152.51,-536.605 3148.09,-512.365"
        },
        {
            "source": "2005",
            "target": "2006",
            "d": "M28.5975,-1085.42C28.5975,-1070.06 28.5975,-1047.74 28.5975,-1032.37"
        },
        {
            "source": "W05-0305",
            "target": "W06-0305",
            "d": "M3226.58,-1088.31C3144.01,-1072.83 3013.03,-1048.28 2925.73,-1031.91"
        },
        {
            "source": "W05-0305",
            "target": "prasad-etal-2008-penn",
            "d": "M3262.88,-1079.5C3176.37,-1030.1 2974.62,-914.913 2882.72,-862.437"
        },
        {
            "source": "W05-0305",
            "target": "prasad-etal-2010-exploiting",
            "d": "M3351.13,-1080.52C3368.79,-1070.41 3387.85,-1057.06 3401.6,-1040.88 3437.73,-998.352 3450.6,-981.078 3450.6,-925.271 3450.6,-925.271 3450.6,-925.271 3450.6,-833.531 3450.6,-784.149 3459.83,-727.728 3466.85,-692.01"
        },
        {
            "source": "W05-0305",
            "target": "J14-4007",
            "d": "M3324.36,-1077.48C3349.24,-1044.56 3387.6,-984.246 3387.6,-925.271 3387.6,-925.271 3387.6,-925.271 3387.6,-833.531 3387.6,-713.572 3349.6,-686.27 3349.6,-566.311 3349.6,-566.311 3349.6,-566.311 3349.6,-474.571 3349.6,-442.749 3357.47,-417.792 3219.6,-358.96 3135.48,-323.066 2884.68,-307.23 2737.9,-300.875"
        },
        {
            "source": "W05-0305",
            "target": "W15-2707",
            "d": "M3391.35,-1093.91C3490.31,-1078.54 3637.6,-1036.9 3637.6,-925.271 3637.6,-925.271 3637.6,-925.271 3637.6,-384.831 3637.6,-301.105 3045.55,-237.749 2808.77,-215.759"
        },
        {
            "source": "I05-1049",
            "target": "H05-1113",
            "d": "M3875.93,-1103.75C3878.36,-1103.75 3880.8,-1103.75 3883.23,-1103.75"
        },
        {
            "source": "H05-1102",
            "target": "P07-1096",
            "d": "M1319.16,-1076.94C1328.13,-1046.32 1343.14,-995.089 1353.2,-960.749"
        },
        {
            "source": "H05-1102",
            "target": "D08-1052",
            "d": "M1300.8,-1076.85C1285.93,-1037.63 1262.7,-960.981 1278.6,-897.401 1280.94,-888.034 1285,-878.533 1289.48,-869.879"
        },
        {
            "source": "H05-1113",
            "target": "W06-1204",
            "d": "M3973.98,-1076.9C3968.71,-1068.17 3962.73,-1058.28 3957.14,-1049.01"
        },
        {
            "source": "H05-1113",
            "target": "D07-1039",
            "d": "M4006.21,-1077.17C4012.55,-1066.36 4019.27,-1053.39 4023.6,-1040.88 4032.53,-1015.04 4037.32,-984.463 4039.85,-961.248"
        },
        {
            "source": "2006",
            "target": "2007",
            "d": "M28.5975,-995.677C28.5975,-980.316 28.5975,-958.002 28.5975,-942.633"
        },
        {
            "source": "W06-1503",
            "target": "W10-4407",
            "d": "M4654.5,-986.769C4658.09,-963.29 4663.73,-927.965 4669.6,-897.401 4683.65,-824.155 4703.06,-739.085 4714.07,-692.031"
        },
        {
            "source": "W06-0305",
            "target": "prasad-etal-2008-penn",
            "d": "M2835.6,-986.824C2835.6,-956.326 2835.6,-905.775 2835.6,-871.583"
        },
        {
            "source": "2007",
            "target": "2008",
            "d": "M28.5975,-905.937C28.5975,-890.576 28.5975,-868.262 28.5975,-852.893"
        },
        {
            "source": "W07-1201",
            "target": "W10-4407",
            "d": "M4788.47,-897.162C4775.32,-849.046 4747.26,-746.325 4732.36,-691.789"
        },
        {
            "source": "P07-1096",
            "target": "D08-1052",
            "d": "M1348.56,-897.893C1343.37,-889.148 1337.48,-879.204 1331.95,-869.865"
        },
        {
            "source": "2008",
            "target": "2009",
            "d": "M28.5975,-816.196C28.5975,-800.835 28.5975,-778.522 28.5975,-763.153"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "W08-0614",
            "d": "M2907.95,-834.531C2910.28,-834.531 2912.61,-834.531 2914.94,-834.531"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "C08-2022",
            "d": "M2872.66,-857.848C2888.36,-866.418 2907.24,-875.08 2925.6,-879.401 3027.06,-903.29 3147.83,-877.354 3220.24,-856.151"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "W09-3029",
            "d": "M2769.8,-823.294C2665.11,-807.009 2461.1,-775.271 2349.36,-757.888"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "W10-4310",
            "d": "M2888.68,-816.303C2897.97,-813.367 2907.55,-810.387 2916.6,-807.661 2972.77,-790.734 2994.19,-803.292 3043.6,-771.661 3076.19,-750.797 3103.89,-715.971 3121.63,-689.984"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "W10-4327",
            "d": "M2782.25,-816.202C2754.61,-805.769 2721.18,-790.781 2694.6,-771.661 2662.76,-748.762 2633.38,-714.831 2613.84,-689.645"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "tonelli-etal-2010-annotation",
            "d": "M2778.4,-818.158C2738,-806.74 2682.86,-790.017 2635.6,-771.661 2567.64,-745.267 2492.15,-708.449 2443.17,-683.508"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "prasad-etal-2010-exploiting",
            "d": "M2888.09,-815.92C2897.53,-812.995 2907.32,-810.118 2916.6,-807.661 2991.25,-787.888 3011.75,-790.704 3086.6,-771.661 3198.46,-743.2 3326.48,-703.677 3403.89,-678.998"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "C10-2118",
            "d": "M2835.75,-807.343C2835.92,-776.846 2836.2,-726.294 2836.39,-692.103"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "W12-3205",
            "d": "M2889.17,-816.528C2935.67,-801.365 2996.89,-780.275 3005.6,-771.661 3054.04,-723.746 3031.01,-690.03 3059.6,-628.181 3078.7,-586.842 3104.58,-541.393 3122.54,-511.142"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "kolachina-etal-2012-evaluation",
            "d": "M2817.61,-808.334C2796.15,-778.266 2759.21,-726.459 2727.6,-681.921 2710.67,-658.066 2711.74,-647.299 2689.6,-628.181 2621.09,-569.024 2525.48,-525.791 2460.97,-500.966"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "J14-4007",
            "d": "M2764.58,-829.253C2600.6,-819.037 2208.06,-792.52 2188.6,-771.661 2062.28,-636.271 2088.32,-456.677 2245.6,-358.96 2290.45,-331.095 2424.24,-314.123 2520.84,-305.173"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "W15-2707",
            "d": "M2764.29,-830.127C2599.05,-821.812 2199.85,-799.129 2145.6,-771.661 2084.46,-740.711 2043.6,-724.573 2043.6,-656.051 2043.6,-656.051 2043.6,-656.051 2043.6,-384.831 2043.6,-268.239 2428.01,-226.426 2614.04,-213.017"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "W16-1704",
            "d": "M2860.89,-809.278C2887.88,-781.479 2928.98,-733.112 2945.6,-681.921 2952.97,-659.203 2947.09,-652.019 2945.6,-628.181 2941.37,-560.403 2926.6,-544.48 2926.6,-476.571 2926.6,-476.571 2926.6,-476.571 2926.6,-295.09 2926.6,-238.792 2888.98,-183.072 2861.09,-149.493"
        },
        {
            "source": "prasad-etal-2008-penn",
            "target": "C16-2026",
            "d": "M2877.39,-812.431C2894.52,-802.08 2913.38,-788.246 2926.6,-771.661 2938.91,-756.209 3002.6,-569.193 3002.6,-566.311 3002.6,-566.311 3002.6,-566.311 3002.6,-295.09 3002.6,-246.363 3002.6,-190.111 3002.6,-154.225"
        },
        {
            "source": "I08-7010",
            "target": "W09-3029",
            "d": "M2260.31,-807.681C2261.8,-799.542 2263.46,-790.402 2265.05,-781.696"
        },
        {
            "source": "C08-2022",
            "target": "J14-4007",
            "d": "M3291.06,-807.557C3299.05,-773.143 3311.6,-710.437 3311.6,-656.051 3311.6,-656.051 3311.6,-656.051 3311.6,-474.571 3311.6,-357.209 2929.54,-316.139 2736.5,-302.878"
        },
        {
            "source": "2009",
            "target": "2010",
            "d": "M28.5975,-726.456C28.5975,-711.095 28.5975,-688.782 28.5975,-673.413"
        },
        {
            "source": "W09-3029",
            "target": "tonelli-etal-2010-annotation",
            "d": "M2303.49,-720.278C2317.66,-709.828 2334.52,-697.397 2349.61,-686.268"
        },
        {
            "source": "W09-3029",
            "target": "C10-2118",
            "d": "M2340.11,-734.235C2422.98,-722.54 2566.67,-701.831 2689.6,-681.921 2707.7,-678.988 2727.03,-675.7 2745.53,-672.476"
        },
        {
            "source": "W09-3029",
            "target": "W12-3205",
            "d": "M2268,-717.474C2266.01,-691.205 2267.59,-651.487 2290.6,-628.181 2393.4,-524.03 2832.76,-490.616 3037.64,-480.578"
        },
        {
            "source": "W09-3029",
            "target": "kolachina-etal-2012-evaluation",
            "d": "M2261.62,-717.7C2254.02,-693.704 2246.56,-657.509 2257.6,-628.181 2276.08,-579.092 2318.47,-535.538 2350.47,-507.851"
        },
        {
            "source": "W09-3029",
            "target": "J14-4007",
            "d": "M2253.01,-718.494C2230.51,-685.314 2195.6,-624.466 2195.6,-566.311 2195.6,-566.311 2195.6,-566.311 2195.6,-474.571 2195.6,-401.201 2411.49,-342.87 2538.03,-314.982"
        },
        {
            "source": "2010",
            "target": "2011",
            "d": "M28.5975,-636.716C28.5975,-621.355 28.5975,-599.042 28.5975,-583.673"
        },
        {
            "source": "tonelli-etal-2010-annotation",
            "target": "W12-3205",
            "d": "M2454.16,-635.795C2465.87,-632.902 2478.05,-630.203 2489.6,-628.181 2662.8,-597.85 2715.77,-644.643 2883.6,-592.181 2929.9,-577.708 2934.64,-558.961 2978.6,-538.441 3009.11,-524.194 3043.9,-510.759 3073.63,-500.072"
        },
        {
            "source": "tonelli-etal-2010-annotation",
            "target": "kolachina-etal-2012-evaluation",
            "d": "M2390.6,-627.863C2390.6,-597.366 2390.6,-546.814 2390.6,-512.622"
        },
        {
            "source": "prasad-etal-2010-exploiting",
            "target": "W12-3205",
            "d": "M3381.3,-647.589C3330.36,-640.249 3268.34,-624.752 3221.6,-592.181 3206.16,-581.424 3180.72,-541.116 3163.11,-511.103"
        },
        {
            "source": "prasad-etal-2010-exploiting",
            "target": "J14-4007",
            "d": "M3473.55,-627.789C3469.64,-568.671 3451.13,-425.153 3363.6,-358.96 3314.9,-322.133 2931.25,-305.858 2738.02,-299.938"
        },
        {
            "source": "C10-2118",
            "target": "W12-3205",
            "d": "M2892.46,-632.748C2919.14,-621.814 2951.15,-607.569 2978.6,-592.181 3023.69,-566.898 3071.71,-532.275 3104.25,-507.524"
        },
        {
            "source": "C10-2118",
            "target": "J14-4007",
            "d": "M2808.52,-629.204C2797.42,-618.505 2785.08,-605.424 2775.6,-592.181 2713.76,-505.853 2663.91,-389.911 2641.08,-332.442"
        },
        {
            "source": "C10-2118",
            "target": "W15-2707",
            "d": "M2825.22,-628.159C2811.31,-594.092 2789.6,-532.033 2789.6,-476.571 2789.6,-476.571 2789.6,-476.571 2789.6,-384.831 2789.6,-331.491 2759.97,-276.03 2737.47,-241.606"
        },
        {
            "source": "C10-2118",
            "target": "W16-1704",
            "d": "M2835.4,-627.895C2833.92,-593.283 2831.6,-530.36 2831.6,-476.571 2831.6,-476.571 2831.6,-476.571 2831.6,-295.09 2831.6,-246.363 2831.6,-190.111 2831.6,-154.225"
        },
        {
            "source": "2011",
            "target": "2012",
            "d": "M28.5975,-546.976C28.5975,-531.615 28.5975,-509.302 28.5975,-493.932"
        },
        {
            "source": "2012",
            "target": "2013",
            "d": "M28.5975,-457.236C28.5975,-441.875 28.5975,-419.562 28.5975,-404.192"
        },
        {
            "source": "kolachina-etal-2012-evaluation",
            "target": "J14-4007",
            "d": "M2423.55,-449.893C2466.18,-417.971 2540.43,-362.369 2586.64,-327.765"
        },
        {
            "source": "2013",
            "target": "2014",
            "d": "M28.5975,-367.496C28.5975,-352.135 28.5975,-329.821 28.5975,-314.452"
        },
        {
            "source": "2014",
            "target": "2015",
            "d": "M28.5975,-277.756C28.5975,-262.395 28.5975,-240.081 28.5975,-224.712"
        },
        {
            "source": "J14-4007",
            "target": "W15-2707",
            "d": "M2652.18,-269.712C2661.25,-260.356 2671.64,-249.625 2681.23,-239.733"
        },
        {
            "source": "J14-4007",
            "target": "W16-1704",
            "d": "M2614.61,-269.405C2603.8,-244.009 2593.06,-205.304 2612.6,-179.48 2630.7,-155.554 2704.41,-138.24 2761.37,-128.115"
        },
        {
            "source": "2015",
            "target": "2016",
            "d": "M28.5975,-188.016C28.5975,-172.655 28.5975,-150.341 28.5975,-134.972"
        },
        {
            "source": "2016",
            "target": "2017",
            "d": "M28.5975,-98.2755C28.5975,-82.9146 28.5975,-60.601 28.5975,-45.2319"
        },
        {
            "source": "W16-1704",
            "target": "C16-2026",
            "d": "M2896.06,-116.61C2898.37,-116.61 2900.68,-116.61 2902.99,-116.61"
        },
        {
            "source": "2017.lilt-15.2",
            "target": "2017.lilt-15.1",
            "d": "M297.75,-26.8701C300.193,-26.8701 302.637,-26.8701 305.08,-26.8701"
        }
    ],
    [
        {
            "id": "1967",
            "name": "1967",
            "x": "28.5975",
            "y": "-3612.77"
        },
        {
            "id": "1969",
            "name": "1969",
            "x": "28.5975",
            "y": "-3523.03"
        },
        {
            "id": "C67-1007",
            "name": "danuta1967Transformational",
            "x": "1101.6",
            "y": "-3620.27"
        },
        {
            "id": "C67-1007",
            "name": "3",
            "x": "1101.6",
            "y": "-3605.27"
        },
        {
            "id": "C69-4701",
            "name": "aravind1969Properties",
            "x": "1101.6",
            "y": "-3530.53"
        },
        {
            "id": "C69-4701",
            "name": "13",
            "x": "1101.6",
            "y": "-3515.53"
        },
        {
            "id": "1975",
            "name": "1975",
            "x": "28.5975",
            "y": "-3433.29"
        },
        {
            "id": "C88-2121",
            "name": "yves1988Parsing",
            "x": "1279.6",
            "y": "-2453.65"
        },
        {
            "id": "C88-2121",
            "name": "202",
            "x": "1279.6",
            "y": "-2438.65"
        },
        {
            "id": "H89-2053",
            "name": "aravind1989An",
            "x": "919.597",
            "y": "-2363.91"
        },
        {
            "id": "H89-2053",
            "name": "0",
            "x": "919.597",
            "y": "-2348.91"
        },
        {
            "id": "H89-1036",
            "name": "anne1989Lexicalized",
            "x": "1101.6",
            "y": "-2363.91"
        },
        {
            "id": "H89-1036",
            "name": "2",
            "x": "1101.6",
            "y": "-2348.91"
        },
        {
            "id": "1977",
            "name": "1977",
            "x": "28.5975",
            "y": "-3343.55"
        },
        {
            "id": "T75-2017",
            "name": "aravind1975A",
            "x": "1303.6",
            "y": "-3440.79"
        },
        {
            "id": "T75-2017",
            "name": "4",
            "x": "1303.6",
            "y": "-3425.79"
        },
        {
            "id": "1978",
            "name": "1978",
            "x": "28.5975",
            "y": "-3253.81"
        },
        {
            "id": "J77-1008",
            "name": "aravind1977Computation",
            "x": "1348.6",
            "y": "-3351.05"
        },
        {
            "id": "J77-1008",
            "name": "???",
            "x": "1348.6",
            "y": "-3336.05"
        },
        {
            "id": "1979",
            "name": "1979",
            "x": "28.5975",
            "y": "-3164.07"
        },
        {
            "id": "T78-1026",
            "name": "aravind1978A",
            "x": "1303.6",
            "y": "-3261.31"
        },
        {
            "id": "T78-1026",
            "name": "4",
            "x": "1303.6",
            "y": "-3246.31"
        },
        {
            "id": "J78-3034",
            "name": "aravind1978A",
            "x": "1454.6",
            "y": "-3261.31"
        },
        {
            "id": "J78-3034",
            "name": "4",
            "x": "1454.6",
            "y": "-3246.31"
        },
        {
            "id": "1980",
            "name": "1980",
            "x": "28.5975",
            "y": "-3074.33"
        },
        {
            "id": "P79-1008",
            "name": "aravind1979Knowledge",
            "x": "1341.6",
            "y": "-3171.57"
        },
        {
            "id": "P79-1008",
            "name": "0",
            "x": "1341.6",
            "y": "-3156.57"
        },
        {
            "id": "1982",
            "name": "1982",
            "x": "28.5975",
            "y": "-2984.59"
        },
        {
            "id": "P80-1009",
            "name": "aravind1980Parasession",
            "x": "1343.6",
            "y": "-3081.83"
        },
        {
            "id": "P80-1009",
            "name": "0",
            "x": "1343.6",
            "y": "-3066.83"
        },
        {
            "id": "P80-1012",
            "name": "aravind1980Phrase",
            "x": "1553.6",
            "y": "-3081.83"
        },
        {
            "id": "P80-1012",
            "name": "2",
            "x": "1553.6",
            "y": "-3066.83"
        },
        {
            "id": "1983",
            "name": "1983",
            "x": "28.5975",
            "y": "-2894.85"
        },
        {
            "id": "P82-1023",
            "name": "aravind1982Twenty",
            "x": "2465.6",
            "y": "-2992.09"
        },
        {
            "id": "P82-1023",
            "name": "0",
            "x": "2465.6",
            "y": "-2977.09"
        },
        {
            "id": "J82-1001",
            "name": "aravind1982Phrase",
            "x": "3795.6",
            "y": "-2992.09"
        },
        {
            "id": "J82-1001",
            "name": "29",
            "x": "3795.6",
            "y": "-2977.09"
        },
        {
            "id": "P83-1002",
            "name": "aravind1983Factoring",
            "x": "3795.6",
            "y": "-2902.35"
        },
        {
            "id": "P83-1002",
            "name": "16",
            "x": "3795.6",
            "y": "-2887.35"
        },
        {
            "id": "C82-1023",
            "name": "aravind1982Processing",
            "x": "4003.6",
            "y": "-2992.09"
        },
        {
            "id": "C82-1023",
            "name": "163",
            "x": "4003.6",
            "y": "-2977.09"
        },
        {
            "id": "C82-1066",
            "name": "bonnie1982Taking",
            "x": "4208.6",
            "y": "-2992.09"
        },
        {
            "id": "C82-1066",
            "name": "21",
            "x": "4208.6",
            "y": "-2977.09"
        },
        {
            "id": "1984",
            "name": "1984",
            "x": "28.5975",
            "y": "-2805.11"
        },
        {
            "id": "P83-1007",
            "name": "barbara1983Providing",
            "x": "3581.6",
            "y": "-2902.35"
        },
        {
            "id": "P83-1007",
            "name": "309",
            "x": "3581.6",
            "y": "-2887.35"
        },
        {
            "id": "P84-1029",
            "name": "aravind1984Preventing",
            "x": "3517.6",
            "y": "-2812.61"
        },
        {
            "id": "P84-1029",
            "name": "33",
            "x": "3517.6",
            "y": "-2797.61"
        },
        {
            "id": "J95-2003",
            "name": "barbara1995{C}entering:",
            "x": "3646.6",
            "y": "-1825.47"
        },
        {
            "id": "J95-2003",
            "name": "1408",
            "x": "3646.6",
            "y": "-1810.47"
        },
        {
            "id": "A83-1001",
            "name": "aravind1983Domain-Independent",
            "x": "4052.6",
            "y": "-2902.35"
        },
        {
            "id": "A83-1001",
            "name": "1",
            "x": "4052.6",
            "y": "-2887.35"
        },
        {
            "id": "1985",
            "name": "1985",
            "x": "28.5975",
            "y": "-2715.37"
        },
        {
            "id": "H86-1017",
            "name": "aravind1986Living",
            "x": "3517.6",
            "y": "-2633.13"
        },
        {
            "id": "H86-1017",
            "name": "3",
            "x": "3517.6",
            "y": "-2618.13"
        },
        {
            "id": "1986",
            "name": "1986",
            "x": "28.5975",
            "y": "-2625.63"
        },
        {
            "id": "P85-1011",
            "name": "vijayshankar1985Some",
            "x": "635.597",
            "y": "-2722.87"
        },
        {
            "id": "P85-1011",
            "name": "113",
            "x": "635.597",
            "y": "-2707.87"
        },
        {
            "id": "C86-1048",
            "name": "vijayshanker1986Tree",
            "x": "504.597",
            "y": "-2633.13"
        },
        {
            "id": "C86-1048",
            "name": "30",
            "x": "504.597",
            "y": "-2618.13"
        },
        {
            "id": "P88-1032",
            "name": "yves1988An",
            "x": "799.597",
            "y": "-2453.65"
        },
        {
            "id": "P88-1032",
            "name": "61",
            "x": "799.597",
            "y": "-2438.65"
        },
        {
            "id": "H05-1102",
            "name": "libin2005Incremental",
            "x": "1311.6",
            "y": "-1107.55"
        },
        {
            "id": "H05-1102",
            "name": "33",
            "x": "1311.6",
            "y": "-1092.55"
        },
        {
            "id": "1987",
            "name": "1987",
            "x": "28.5975",
            "y": "-2535.89"
        },
        {
            "id": "J86-1015",
            "name": "aravind1986Three",
            "x": "3756.6",
            "y": "-2633.13"
        },
        {
            "id": "J86-1015",
            "name": "???",
            "x": "3756.6",
            "y": "-2618.13"
        },
        {
            "id": "H86-1005",
            "name": "aravind1986Research",
            "x": "3952.6",
            "y": "-2633.13"
        },
        {
            "id": "H86-1005",
            "name": "0",
            "x": "3952.6",
            "y": "-2618.13"
        },
        {
            "id": "H86-1020",
            "name": "vijayshankar1986Some",
            "x": "2119.6",
            "y": "-2633.13"
        },
        {
            "id": "H86-1020",
            "name": "66",
            "x": "2119.6",
            "y": "-2618.13"
        },
        {
            "id": "T87-1011",
            "name": "aravind1987Unification",
            "x": "504.597",
            "y": "-2543.39"
        },
        {
            "id": "T87-1011",
            "name": "4",
            "x": "504.597",
            "y": "-2528.39"
        },
        {
            "id": "P88-1034",
            "name": "david1988{C}ombinatory",
            "x": "367.597",
            "y": "-2453.65"
        },
        {
            "id": "P88-1034",
            "name": "39",
            "x": "367.597",
            "y": "-2438.65"
        },
        {
            "id": "1988",
            "name": "1988",
            "x": "28.5975",
            "y": "-2446.15"
        },
        {
            "id": "T87-1041",
            "name": "aravind1987Generation",
            "x": "3777.6",
            "y": "-2543.39"
        },
        {
            "id": "T87-1041",
            "name": "7",
            "x": "3777.6",
            "y": "-2528.39"
        },
        {
            "id": "P87-1015",
            "name": "vijayshanker1987Characterizing",
            "x": "210.597",
            "y": "-2543.39"
        },
        {
            "id": "P87-1015",
            "name": "217",
            "x": "210.597",
            "y": "-2528.39"
        },
        {
            "id": "P89-1027",
            "name": "aravind1989Treatment",
            "x": "367.597",
            "y": "-2363.91"
        },
        {
            "id": "P89-1027",
            "name": "7",
            "x": "367.597",
            "y": "-2348.91"
        },
        {
            "id": "1989",
            "name": "1989",
            "x": "28.5975",
            "y": "-2356.41"
        },
        {
            "id": "C96-2103",
            "name": "anoop1996Coordination",
            "x": "1311.6",
            "y": "-1735.73"
        },
        {
            "id": "C96-2103",
            "name": "39",
            "x": "1311.6",
            "y": "-1720.73"
        },
        {
            "id": "H90-1010",
            "name": "yves1990Two",
            "x": "1425.6",
            "y": "-2274.17"
        },
        {
            "id": "H90-1010",
            "name": "0",
            "x": "1425.6",
            "y": "-2259.17"
        },
        {
            "id": "C90-3001",
            "name": "anne1990Using",
            "x": "1268.6",
            "y": "-2274.17"
        },
        {
            "id": "C90-3001",
            "name": "73",
            "x": "1268.6",
            "y": "-2259.17"
        },
        {
            "id": "H91-1035",
            "name": "aravind1991Fixed",
            "x": "1668.6",
            "y": "-2184.43"
        },
        {
            "id": "H91-1035",
            "name": "8",
            "x": "1668.6",
            "y": "-2169.43"
        },
        {
            "id": "E91-1005",
            "name": "tilman1991Long-Distance",
            "x": "775.597",
            "y": "-2184.43"
        },
        {
            "id": "E91-1005",
            "name": "74",
            "x": "775.597",
            "y": "-2169.43"
        },
        {
            "id": "A92-1030",
            "name": "patrick1992{XTAG}",
            "x": "1268.6",
            "y": "-2094.69"
        },
        {
            "id": "A92-1030",
            "name": "27",
            "x": "1268.6",
            "y": "-2079.69"
        },
        {
            "id": "C94-1024",
            "name": "aravind1994Disambiguation",
            "x": "1816.6",
            "y": "-1915.21"
        },
        {
            "id": "C94-1024",
            "name": "130",
            "x": "1816.6",
            "y": "-1900.21"
        },
        {
            "id": "P95-1036",
            "name": "srinivas1995Some",
            "x": "1557.6",
            "y": "-1825.47"
        },
        {
            "id": "P95-1036",
            "name": "19",
            "x": "1557.6",
            "y": "-1810.47"
        },
        {
            "id": "J99-2004",
            "name": "srinivas1999{S}upertagging:",
            "x": "1592.6",
            "y": "-1556.25"
        },
        {
            "id": "J99-2004",
            "name": "331",
            "x": "1592.6",
            "y": "-1541.25"
        },
        {
            "id": "1990",
            "name": "1990",
            "x": "28.5975",
            "y": "-2266.67"
        },
        {
            "id": "W89-0235",
            "name": "yves1989The",
            "x": "765.597",
            "y": "-2363.91"
        },
        {
            "id": "W89-0235",
            "name": "9",
            "x": "765.597",
            "y": "-2348.91"
        },
        {
            "id": "H89-1035",
            "name": "aravind1989Natural",
            "x": "3762.6",
            "y": "-2363.91"
        },
        {
            "id": "H89-1035",
            "name": "???",
            "x": "3762.6",
            "y": "-2348.91"
        },
        {
            "id": "1991",
            "name": "1991",
            "x": "28.5975",
            "y": "-2176.93"
        },
        {
            "id": "W90-0214",
            "name": "anthony1990A",
            "x": "775.597",
            "y": "-2274.17"
        },
        {
            "id": "W90-0214",
            "name": "???",
            "x": "775.597",
            "y": "-2259.17"
        },
        {
            "id": "W90-0217",
            "name": "aravind1990Coordination",
            "x": "3786.6",
            "y": "-2274.17"
        },
        {
            "id": "W90-0217",
            "name": "0",
            "x": "3786.6",
            "y": "-2259.17"
        },
        {
            "id": "H90-1099",
            "name": "aravind1990Natural",
            "x": "4003.6",
            "y": "-2274.17"
        },
        {
            "id": "H90-1099",
            "name": "0",
            "x": "4003.6",
            "y": "-2259.17"
        },
        {
            "id": "1992",
            "name": "1992",
            "x": "28.5975",
            "y": "-2087.19"
        },
        {
            "id": "H91-1103",
            "name": "aravind1991Natural",
            "x": "3762.6",
            "y": "-2184.43"
        },
        {
            "id": "H91-1103",
            "name": "0",
            "x": "3762.6",
            "y": "-2169.43"
        },
        {
            "id": "W08-2302",
            "name": "joan2008Flexible",
            "x": "673.597",
            "y": "-838.331"
        },
        {
            "id": "W08-2302",
            "name": "3",
            "x": "673.597",
            "y": "-823.331"
        },
        {
            "id": "1991.iwpt-1.1",
            "name": "masaru1991Proceedings",
            "x": "3975.6",
            "y": "-2184.43"
        },
        {
            "id": "1991.iwpt-1.1",
            "name": "???",
            "x": "3975.6",
            "y": "-2169.43"
        },
        {
            "id": "1993",
            "name": "1993",
            "x": "28.5975",
            "y": "-1997.45"
        },
        {
            "id": "H92-1019",
            "name": "aravind1992Session",
            "x": "3765.6",
            "y": "-2094.69"
        },
        {
            "id": "H92-1019",
            "name": "???",
            "x": "3765.6",
            "y": "-2079.69"
        },
        {
            "id": "H92-1123",
            "name": "aravind1992Natural",
            "x": "3961.6",
            "y": "-2094.69"
        },
        {
            "id": "H92-1123",
            "name": "???",
            "x": "3961.6",
            "y": "-2079.69"
        },
        {
            "id": "1994",
            "name": "1994",
            "x": "28.5975",
            "y": "-1907.71"
        },
        {
            "id": "H93-1113",
            "name": "aravind1993Natural",
            "x": "3762.6",
            "y": "-2004.95"
        },
        {
            "id": "H93-1113",
            "name": "???",
            "x": "3762.6",
            "y": "-1989.95"
        },
        {
            "id": "1995",
            "name": "1995",
            "x": "28.5975",
            "y": "-1817.97"
        },
        {
            "id": "W94-0107",
            "name": "aravind1994Complexity",
            "x": "3779.6",
            "y": "-1915.21"
        },
        {
            "id": "W94-0107",
            "name": "???",
            "x": "3779.6",
            "y": "-1900.21"
        },
        {
            "id": "P94-1005",
            "name": "aravind1994From",
            "x": "3984.6",
            "y": "-1915.21"
        },
        {
            "id": "P94-1005",
            "name": "0",
            "x": "3984.6",
            "y": "-1900.21"
        },
        {
            "id": "W00-1307",
            "name": "fei2000A",
            "x": "1857.6",
            "y": "-1466.51"
        },
        {
            "id": "W00-1307",
            "name": "44",
            "x": "1857.6",
            "y": "-1451.51"
        },
        {
            "id": "P03-1064",
            "name": "libin2003A",
            "x": "1646.6",
            "y": "-1287.03"
        },
        {
            "id": "P03-1064",
            "name": "14",
            "x": "1646.6",
            "y": "-1272.03"
        },
        {
            "id": "1996",
            "name": "1996",
            "x": "28.5975",
            "y": "-1728.23"
        },
        {
            "id": "prasad-etal-2010-exploiting",
            "name": "rashmi2010Exploiting",
            "x": "3474.6",
            "y": "-658.851"
        },
        {
            "id": "prasad-etal-2010-exploiting",
            "name": "30",
            "x": "3474.6",
            "y": "-643.851"
        },
        {
            "id": "W12-3205",
            "name": "bonnie2012Discourse",
            "x": "3143.6",
            "y": "-479.371"
        },
        {
            "id": "W12-3205",
            "name": "18",
            "x": "3143.6",
            "y": "-464.371"
        },
        {
            "id": "1998",
            "name": "1998",
            "x": "28.5975",
            "y": "-1638.49"
        },
        {
            "id": "1999",
            "name": "1999",
            "x": "28.5975",
            "y": "-1548.75"
        },
        {
            "id": "W98-0315",
            "name": "bonnie1998Anchoring",
            "x": "3166.6",
            "y": "-1645.99"
        },
        {
            "id": "W98-0315",
            "name": "58",
            "x": "3166.6",
            "y": "-1630.99"
        },
        {
            "id": "P99-1006",
            "name": "bonnie1999Discourse",
            "x": "2984.6",
            "y": "-1556.25"
        },
        {
            "id": "P99-1006",
            "name": "58",
            "x": "2984.6",
            "y": "-1541.25"
        },
        {
            "id": "W03-2608",
            "name": "eleni2003Anaphoric",
            "x": "3029.6",
            "y": "-1287.03"
        },
        {
            "id": "W03-2608",
            "name": "19",
            "x": "3029.6",
            "y": "-1272.03"
        },
        {
            "id": "J03-4002",
            "name": "bonnie2003Anaphora",
            "x": "2825.6",
            "y": "-1287.03"
        },
        {
            "id": "J03-4002",
            "name": "190",
            "x": "2825.6",
            "y": "-1272.03"
        },
        {
            "id": "W04-2703",
            "name": "eleni2004Annotating",
            "x": "2664.6",
            "y": "-1197.29"
        },
        {
            "id": "W04-2703",
            "name": "74",
            "x": "2664.6",
            "y": "-1182.29"
        },
        {
            "id": "W04-2704",
            "name": "olga2004{P}roposition",
            "x": "3354.6",
            "y": "-1197.29"
        },
        {
            "id": "W04-2704",
            "name": "13",
            "x": "3354.6",
            "y": "-1182.29"
        },
        {
            "id": "W04-0212",
            "name": "rashmi2004Annotation",
            "x": "3095.6",
            "y": "-1197.29"
        },
        {
            "id": "W04-0212",
            "name": "33",
            "x": "3095.6",
            "y": "-1182.29"
        },
        {
            "id": "W05-0305",
            "name": "nikhil2005Attribution",
            "x": "3303.6",
            "y": "-1107.55"
        },
        {
            "id": "W05-0305",
            "name": "56",
            "x": "3303.6",
            "y": "-1092.55"
        },
        {
            "id": "prasad-etal-2008-penn",
            "name": "rashmi2008The",
            "x": "2835.6",
            "y": "-838.331"
        },
        {
            "id": "prasad-etal-2008-penn",
            "name": "680",
            "x": "2835.6",
            "y": "-823.331"
        },
        {
            "id": "W98-0119",
            "name": "aravind1998Partial",
            "x": "3787.6",
            "y": "-1645.99"
        },
        {
            "id": "W98-0119",
            "name": "1",
            "x": "3787.6",
            "y": "-1630.99"
        },
        {
            "id": "2000",
            "name": "2000",
            "x": "28.5975",
            "y": "-1459.01"
        },
        {
            "id": "2001",
            "name": "2001",
            "x": "28.5975",
            "y": "-1369.27"
        },
        {
            "id": "W00-2015",
            "name": "aravind2000Relationship",
            "x": "3811.6",
            "y": "-1466.51"
        },
        {
            "id": "W00-2015",
            "name": "12",
            "x": "3811.6",
            "y": "-1451.51"
        },
        {
            "id": "W00-1605",
            "name": "anoop2000Some",
            "x": "4016.6",
            "y": "-1466.51"
        },
        {
            "id": "W00-1605",
            "name": "27",
            "x": "4016.6",
            "y": "-1451.51"
        },
        {
            "id": "W00-1208",
            "name": "fei2000Comparing",
            "x": "2007.6",
            "y": "-1466.51"
        },
        {
            "id": "W00-1208",
            "name": "9",
            "x": "2007.6",
            "y": "-1451.51"
        },
        {
            "id": "2003",
            "name": "2003",
            "x": "28.5975",
            "y": "-1279.53"
        },
        {
            "id": "W01-1803",
            "name": "aravind2001The",
            "x": "3778.6",
            "y": "-1376.77"
        },
        {
            "id": "W01-1803",
            "name": "3",
            "x": "3778.6",
            "y": "-1361.77"
        },
        {
            "id": "2004",
            "name": "2004",
            "x": "28.5975",
            "y": "-1189.79"
        },
        {
            "id": "W03-1012",
            "name": "libin2003Using",
            "x": "3909.6",
            "y": "-1287.03"
        },
        {
            "id": "W03-1012",
            "name": "53",
            "x": "3909.6",
            "y": "-1272.03"
        },
        {
            "id": "W03-0402",
            "name": "libin2003An",
            "x": "3762.6",
            "y": "-1287.03"
        },
        {
            "id": "W03-0402",
            "name": "52",
            "x": "3762.6",
            "y": "-1272.03"
        },
        {
            "id": "miltsakaki-etal-2004-penn",
            "name": "eleni2004The",
            "x": "2875.6",
            "y": "-1197.29"
        },
        {
            "id": "miltsakaki-etal-2004-penn",
            "name": "161",
            "x": "2875.6",
            "y": "-1182.29"
        },
        {
            "id": "W06-0305",
            "name": "rashmi2006Annotating",
            "x": "2835.6",
            "y": "-1017.81"
        },
        {
            "id": "W06-0305",
            "name": "22",
            "x": "2835.6",
            "y": "-1002.81"
        },
        {
            "id": "I08-7010",
            "name": "rashmi2008Towards",
            "x": "2255.6",
            "y": "-838.331"
        },
        {
            "id": "I08-7010",
            "name": "16",
            "x": "2255.6",
            "y": "-823.331"
        },
        {
            "id": "2005",
            "name": "2005",
            "x": "28.5975",
            "y": "-1100.05"
        },
        {
            "id": "W08-0614",
            "name": "hong2008A",
            "x": "2982.6",
            "y": "-838.331"
        },
        {
            "id": "W08-0614",
            "name": "3",
            "x": "2982.6",
            "y": "-823.331"
        },
        {
            "id": "kolachina-etal-2012-evaluation",
            "name": "sudheer2012Evaluation",
            "x": "2390.6",
            "y": "-479.371"
        },
        {
            "id": "kolachina-etal-2012-evaluation",
            "name": "10",
            "x": "2390.6",
            "y": "-464.371"
        },
        {
            "id": "J14-4007",
            "name": "rashmi2014Reflections",
            "x": "2627.6",
            "y": "-299.89"
        },
        {
            "id": "J14-4007",
            "name": "38",
            "x": "2627.6",
            "y": "-284.89"
        },
        {
            "id": "W10-4310",
            "name": "annie2010Using",
            "x": "3142.6",
            "y": "-658.851"
        },
        {
            "id": "W10-4310",
            "name": "46",
            "x": "3142.6",
            "y": "-643.851"
        },
        {
            "id": "C10-2118",
            "name": "rashmi2010Realization",
            "x": "2836.6",
            "y": "-658.851"
        },
        {
            "id": "C10-2118",
            "name": "52",
            "x": "2836.6",
            "y": "-643.851"
        },
        {
            "id": "2006",
            "name": "2006",
            "x": "28.5975",
            "y": "-1010.31"
        },
        {
            "id": "W15-2707",
            "name": "rashmi2015Bridging",
            "x": "2712.6",
            "y": "-210.15"
        },
        {
            "id": "W15-2707",
            "name": "2",
            "x": "2712.6",
            "y": "-195.15"
        },
        {
            "id": "I05-1049",
            "name": "sriram2005Relative",
            "x": "3789.6",
            "y": "-1107.55"
        },
        {
            "id": "I05-1049",
            "name": "9",
            "x": "3789.6",
            "y": "-1092.55"
        },
        {
            "id": "H05-1113",
            "name": "sriram2005Measuring",
            "x": "3989.6",
            "y": "-1107.55"
        },
        {
            "id": "H05-1113",
            "name": "55",
            "x": "3989.6",
            "y": "-1092.55"
        },
        {
            "id": "P07-1096",
            "name": "libin2007Guided",
            "x": "1363.6",
            "y": "-928.071"
        },
        {
            "id": "P07-1096",
            "name": "136",
            "x": "1363.6",
            "y": "-913.071"
        },
        {
            "id": "D08-1052",
            "name": "libin2008{LTAG}",
            "x": "1311.6",
            "y": "-838.331"
        },
        {
            "id": "D08-1052",
            "name": "24",
            "x": "1311.6",
            "y": "-823.331"
        },
        {
            "id": "W06-1204",
            "name": "sriram2006Using",
            "x": "3936.6",
            "y": "-1017.81"
        },
        {
            "id": "W06-1204",
            "name": "22",
            "x": "3936.6",
            "y": "-1002.81"
        },
        {
            "id": "D07-1039",
            "name": "diana2007Detecting",
            "x": "4042.6",
            "y": "-928.071"
        },
        {
            "id": "D07-1039",
            "name": "35",
            "x": "4042.6",
            "y": "-913.071"
        },
        {
            "id": "2007",
            "name": "2007",
            "x": "28.5975",
            "y": "-920.571"
        },
        {
            "id": "W06-3902",
            "name": "nikhil2006Extracting",
            "x": "4161.6",
            "y": "-1017.81"
        },
        {
            "id": "W06-3902",
            "name": "???",
            "x": "4161.6",
            "y": "-1002.81"
        },
        {
            "id": "W06-3601",
            "name": "liang2006A",
            "x": "4326.6",
            "y": "-1017.81"
        },
        {
            "id": "W06-3601",
            "name": "63",
            "x": "4326.6",
            "y": "-1002.81"
        },
        {
            "id": "W06-1635",
            "name": "julia2006Protein",
            "x": "4474.6",
            "y": "-1017.81"
        },
        {
            "id": "W06-1635",
            "name": "1",
            "x": "4474.6",
            "y": "-1002.81"
        },
        {
            "id": "W06-1503",
            "name": "alexandra2006The",
            "x": "4650.6",
            "y": "-1017.81"
        },
        {
            "id": "W06-1503",
            "name": "9",
            "x": "4650.6",
            "y": "-1002.81"
        },
        {
            "id": "W10-4407",
            "name": "joan2010Unavoidable",
            "x": "4722.6",
            "y": "-658.851"
        },
        {
            "id": "W10-4407",
            "name": "9",
            "x": "4722.6",
            "y": "-643.851"
        },
        {
            "id": "2006.amta-papers.8",
            "name": "liang2006Statistical",
            "x": "4838.6",
            "y": "-1017.81"
        },
        {
            "id": "2006.amta-papers.8",
            "name": "183",
            "x": "4838.6",
            "y": "-1002.81"
        },
        {
            "id": "2008",
            "name": "2008",
            "x": "28.5975",
            "y": "-830.831"
        },
        {
            "id": "W07-1201",
            "name": "joan2007Multi-Component",
            "x": "4795.6",
            "y": "-928.071"
        },
        {
            "id": "W07-1201",
            "name": "3",
            "x": "4795.6",
            "y": "-913.071"
        },
        {
            "id": "W07-0407",
            "name": "sriram2007Discriminative",
            "x": "5041.6",
            "y": "-928.071"
        },
        {
            "id": "W07-0407",
            "name": "7",
            "x": "5041.6",
            "y": "-913.071"
        },
        {
            "id": "2009",
            "name": "2009",
            "x": "28.5975",
            "y": "-741.091"
        },
        {
            "id": "C08-2022",
            "name": "emily2008Easily",
            "x": "3284.6",
            "y": "-838.331"
        },
        {
            "id": "C08-2022",
            "name": "82",
            "x": "3284.6",
            "y": "-823.331"
        },
        {
            "id": "W09-3029",
            "name": "umangi2009The",
            "x": "2271.6",
            "y": "-748.591"
        },
        {
            "id": "W09-3029",
            "name": "32",
            "x": "2271.6",
            "y": "-733.591"
        },
        {
            "id": "W10-4327",
            "name": "annie2010Discourse",
            "x": "2589.6",
            "y": "-658.851"
        },
        {
            "id": "W10-4327",
            "name": "90",
            "x": "2589.6",
            "y": "-643.851"
        },
        {
            "id": "tonelli-etal-2010-annotation",
            "name": "sara2010Annotation",
            "x": "2390.6",
            "y": "-658.851"
        },
        {
            "id": "tonelli-etal-2010-annotation",
            "name": "33",
            "x": "2390.6",
            "y": "-643.851"
        },
        {
            "id": "W16-1704",
            "name": "bonnie2016A",
            "x": "2831.6",
            "y": "-120.41"
        },
        {
            "id": "W16-1704",
            "name": "12",
            "x": "2831.6",
            "y": "-105.41"
        },
        {
            "id": "C16-2026",
            "name": "alan2016Annotating",
            "x": "3002.6",
            "y": "-120.41"
        },
        {
            "id": "C16-2026",
            "name": "2",
            "x": "3002.6",
            "y": "-105.41"
        },
        {
            "id": "2010",
            "name": "2010",
            "x": "28.5975",
            "y": "-651.351"
        },
        {
            "id": "2011",
            "name": "2011",
            "x": "28.5975",
            "y": "-561.611"
        },
        {
            "id": "W10-3809",
            "name": "sriram2010A",
            "x": "4899.6",
            "y": "-658.851"
        },
        {
            "id": "W10-3809",
            "name": "4",
            "x": "4899.6",
            "y": "-643.851"
        },
        {
            "id": "W10-3714",
            "name": "aravind2010Multiword",
            "x": "5080.6",
            "y": "-658.851"
        },
        {
            "id": "W10-3714",
            "name": "2",
            "x": "5080.6",
            "y": "-643.851"
        },
        {
            "id": "2012",
            "name": "2012",
            "x": "28.5975",
            "y": "-471.871"
        },
        {
            "id": "W11-0806",
            "name": "william2011Tree-Rewriting",
            "x": "3782.6",
            "y": "-569.111"
        },
        {
            "id": "W11-0806",
            "name": "7",
            "x": "3782.6",
            "y": "-554.111"
        },
        {
            "id": "D11-1111",
            "name": "nikhil2011Computing",
            "x": "4012.6",
            "y": "-569.111"
        },
        {
            "id": "D11-1111",
            "name": "0",
            "x": "4012.6",
            "y": "-554.111"
        },
        {
            "id": "2013",
            "name": "2013",
            "x": "28.5975",
            "y": "-382.131"
        },
        {
            "id": "W12-4601",
            "name": "joan2012Delayed",
            "x": "3744.6",
            "y": "-479.371"
        },
        {
            "id": "W12-4601",
            "name": "0",
            "x": "3744.6",
            "y": "-464.371"
        },
        {
            "id": "2014",
            "name": "2014",
            "x": "28.5975",
            "y": "-292.39"
        },
        {
            "id": "W13-3702",
            "name": "aravind2013Invited",
            "x": "3751.6",
            "y": "-389.631"
        },
        {
            "id": "W13-3702",
            "name": "0",
            "x": "3751.6",
            "y": "-374.631"
        },
        {
            "id": "2015",
            "name": "2015",
            "x": "28.5975",
            "y": "-202.65"
        },
        {
            "id": "W14-5101",
            "name": "aravind2014Keynote",
            "x": "3758.6",
            "y": "-299.89"
        },
        {
            "id": "W14-5101",
            "name": "0",
            "x": "3758.6",
            "y": "-284.89"
        },
        {
            "id": "2016",
            "name": "2016",
            "x": "28.5975",
            "y": "-112.91"
        },
        {
            "id": "J15-4009",
            "name": "barbara2015{O}bituaries:",
            "x": "3142.6",
            "y": "-210.15"
        },
        {
            "id": "J15-4009",
            "name": "???",
            "x": "3142.6",
            "y": "-195.15"
        },
        {
            "id": "2017",
            "name": "2017",
            "x": "28.5975",
            "y": "-23.1701"
        },
        {
            "id": "2017.lilt-15.1",
            "name": "james2017Lexical",
            "x": "396.597",
            "y": "-30.6701"
        },
        {
            "id": "2017.lilt-15.1",
            "name": "???",
            "x": "396.597",
            "y": "-15.6701"
        },
        {
            "id": "2017.lilt-15.2",
            "name": "aravind2017Factorization",
            "x": "186.597",
            "y": "-30.6701"
        },
        {
            "id": "2017.lilt-15.2",
            "name": "0",
            "x": "186.597",
            "y": "-15.6701"
        }
    ],
    [
        "28.5975,-3544.73 28.5975,-3544.73 28.5975,-3544.73 28.5975,-3544.73",
        "1105.1,-3563.74 1101.6,-3553.74 1098.1,-3563.74 1105.1,-3563.74",
        "28.5975,-3454.99 28.5975,-3454.99 28.5975,-3454.99 28.5975,-3454.99",
        "1260.29,-2486.73 1262.47,-2476.36 1254.3,-2483.11 1260.29,-2486.73",
        "936.911,-2394.93 930.137,-2386.78 930.353,-2397.37 936.911,-2394.93",
        "1105.1,-2397.28 1101.6,-2387.28 1098.1,-2397.28 1105.1,-2397.28",
        "28.5975,-3365.25 28.5975,-3365.25 28.5975,-3365.25 28.5975,-3365.25",
        "28.5975,-3275.51 28.5975,-3275.51 28.5975,-3275.51 28.5975,-3275.51",
        "28.5975,-3185.77 28.5975,-3185.77 28.5975,-3185.77 28.5975,-3185.77",
        "28.5975,-3096.03 28.5975,-3096.03 28.5975,-3096.03 28.5975,-3096.03",
        "28.5975,-3006.29 28.5975,-3006.29 28.5975,-3006.29 28.5975,-3006.29",
        "28.5975,-2916.55 28.5975,-2916.55 28.5975,-2916.55 28.5975,-2916.55",
        "3799.1,-2935.56 3795.6,-2925.56 3792.1,-2935.56 3799.1,-2935.56",
        "4285.63,-2969.07 4275.4,-2971.83 4285.12,-2976.05 4285.63,-2969.07",
        "28.5975,-2826.81 28.5975,-2826.81 28.5975,-2826.81 28.5975,-2826.81",
        "3545.04,-2841.5 3536.32,-2835.48 3539.38,-2845.62 3545.04,-2841.5",
        "3650.1,-1858.83 3646.6,-1848.83 3643.1,-1858.83 3650.1,-1858.83",
        "28.5975,-2737.07 28.5975,-2737.07 28.5975,-2737.07 28.5975,-2737.07",
        "3521.1,-2666.34 3517.6,-2656.34 3514.1,-2666.34 3521.1,-2666.34",
        "28.5975,-2647.33 28.5975,-2647.33 28.5975,-2647.33 28.5975,-2647.33",
        "550.879,-2657.12 540.623,-2654.46 546.983,-2662.93 550.879,-2657.12",
        "781.912,-2486.36 784.16,-2476.01 775.946,-2482.7 781.912,-2486.36",
        "1209.16,-1109.06 1219.01,-1105.17 1208.88,-1102.07 1209.16,-1109.06",
        "28.5975,-2557.59 28.5975,-2557.59 28.5975,-2557.59 28.5975,-2557.59",
        "1414.37,-1102.49 1404.29,-1105.75 1414.2,-1109.48 1414.37,-1102.49",
        "508.098,-2576.6 504.597,-2566.6 501.098,-2576.6 508.098,-2576.6",
        "371.303,-2486.58 367.252,-2476.79 364.314,-2486.96 371.303,-2486.58",
        "28.5975,-2467.85 28.5975,-2467.85 28.5975,-2467.85 28.5975,-2467.85",
        "317.62,-2482.79 324.641,-2474.86 314.205,-2476.68 317.62,-2482.79",
        "297.004,-2388.43 304.575,-2381.02 294.035,-2382.09 297.004,-2388.43",
        "28.5975,-2378.11 28.5975,-2378.11 28.5975,-2378.11 28.5975,-2378.11",
        "1191.43,-2453.35 1201.43,-2449.85 1191.43,-2446.35 1191.43,-2453.35",
        "455.693,-2375.43 445.197,-2376.87 454.3,-2382.29 455.693,-2375.43",
        "881.798,-2393.09 887.805,-2384.36 877.667,-2387.44 881.798,-2393.09",
        "1029.09,-2385.82 1037.72,-2379.67 1027.14,-2379.1 1029.09,-2385.82",
        "1195.84,-1740.78 1205.48,-1736.38 1195.2,-1733.81 1195.84,-1740.78",
        "371.098,-2397.12 367.597,-2387.12 364.098,-2397.12 371.098,-2397.12",
        "982.04,-2378.28 971.453,-2378.67 979.976,-2384.97 982.04,-2378.28",
        "1157.69,-2384.86 1147.18,-2383.58 1154.6,-2391.14 1157.69,-2384.86",
        "1401.68,-2305.96 1405.33,-2296.01 1396.27,-2301.51 1401.68,-2305.96",
        "1275.88,-2306.84 1271.42,-2297.24 1268.92,-2307.53 1275.88,-2306.84",
        "1665.47,-2218.18 1664.14,-2207.67 1658.62,-2216.71 1665.47,-2218.18",
        "877.045,-2194.83 866.545,-2196.25 875.636,-2201.69 877.045,-2194.83",
        "1241.56,-2126.86 1245.28,-2116.94 1236.18,-2122.37 1241.56,-2126.86",
        "1813.93,-1948.91 1812.05,-1938.48 1807.02,-1947.81 1813.93,-1948.91",
        "1561.42,-1858.8 1557.84,-1848.83 1554.42,-1858.86 1561.42,-1858.8",
        "1570.69,-1589.43 1573.56,-1579.23 1564.96,-1585.41 1570.69,-1589.43",
        "28.5975,-2288.37 28.5975,-2288.37 28.5975,-2288.37 28.5975,-2288.37",
        "838.171,-2363.61 848.171,-2360.11 838.171,-2356.61 838.171,-2363.61",
        "28.5975,-2198.63 28.5975,-2198.63 28.5975,-2198.63 28.5975,-2198.63",
        "779.098,-2217.64 775.597,-2207.64 772.098,-2217.64 779.098,-2217.64",
        "1348.09,-2273.87 1358.09,-2270.37 1348.09,-2266.87 1348.09,-2273.87",
        "1272.1,-2127.9 1268.6,-2117.9 1265.1,-2127.9 1272.1,-2127.9",
        "28.5975,-2108.89 28.5975,-2108.89 28.5975,-2108.89 28.5975,-2108.89",
        "1425.6,-1736.42 1415.34,-1739.03 1424.99,-1743.39 1425.6,-1736.42",
        "1221.98,-1122.27 1231.24,-1117.12 1220.79,-1115.37 1221.98,-1122.27",
        "677.098,-871.693 673.597,-861.693 670.098,-871.694 677.098,-871.693",
        "28.5975,-2019.15 28.5975,-2019.15 28.5975,-2019.15 28.5975,-2019.15",
        "1526.08,-1856.58 1531.05,-1847.22 1521.33,-1851.44 1526.08,-1856.58",
        "28.5975,-1929.41 28.5975,-1929.41 28.5975,-1929.41 28.5975,-1929.41",
        "28.5975,-1839.67 28.5975,-1839.67 28.5975,-1839.67 28.5975,-1839.67",
        "1624.3,-1841.57 1613.7,-1841.68 1622.05,-1848.2 1624.3,-1841.57",
        "1606.12,-1588.14 1599.88,-1579.58 1599.42,-1590.17 1606.12,-1588.14",
        "1854.98,-1499.91 1853.09,-1489.48 1848.07,-1498.81 1854.98,-1499.91",
        "1679.07,-1312.97 1669.82,-1307.79 1673.82,-1317.6 1679.07,-1312.97",
        "1401.16,-1116.1 1390.7,-1117.74 1399.9,-1122.99 1401.16,-1116.1",
        "28.5975,-1749.93 28.5975,-1749.93 28.5975,-1749.93 28.5975,-1749.93",
        "3505.19,-687.298 3496.33,-681.486 3499.63,-691.554 3505.19,-687.298",
        "3248.09,-479.642 3237.79,-482.132 3247.39,-486.607 3248.09,-479.642",
        "28.5975,-1660.19 28.5975,-1660.19 28.5975,-1660.19 28.5975,-1660.19",
        "1800.74,-1470.68 1810.47,-1466.5 1800.26,-1463.7 1800.74,-1470.68",
        "1315.1,-1140.91 1311.6,-1130.91 1308.1,-1140.91 1315.1,-1140.91",
        "28.5975,-1570.45 28.5975,-1570.45 28.5975,-1570.45 28.5975,-1570.45",
        "3041.92,-1577.2 3031.39,-1576.01 3038.88,-1583.5 3041.92,-1577.2",
        "1902.51,-1481.85 1891.93,-1481.32 1899.87,-1488.33 1902.51,-1481.85",
        "3046.37,-1318.18 3039.52,-1310.09 3039.84,-1320.68 3046.37,-1318.18",
        "2823.99,-1320.43 2821.66,-1310.1 2817.03,-1319.63 2823.99,-1320.43",
        "2667.77,-1230.68 2664.36,-1220.65 2660.77,-1230.62 2667.77,-1230.68",
        "3343.09,-1231 3343.46,-1220.41 3336.57,-1228.45 3343.09,-1231",
        "3130.93,-1224.98 3121.83,-1219.55 3125.56,-1229.47 3130.93,-1224.98",
        "3394.73,-1117.42 3384.14,-1117.75 3392.62,-1124.09 3394.73,-1117.42",
        "2897.36,-853.818 2886.76,-853.696 2894.97,-860.398 2897.36,-853.818",
        "3184.68,-505.107 3174.78,-501.331 3180.17,-510.456 3184.68,-505.107",
        "28.5975,-1480.71 28.5975,-1480.71 28.5975,-1480.71 28.5975,-1480.71",
        "2848.92,-1316.58 2840.8,-1309.78 2842.9,-1320.16 2848.92,-1316.58",
        "2680.83,-1228.37 2673.88,-1220.38 2674.32,-1230.96 2680.83,-1228.37",
        "3120.8,-1227.2 3112.91,-1220.13 3114.66,-1230.58 3120.8,-1227.2",
        "3271.01,-1139.22 3275.65,-1129.7 3266.09,-1134.25 3271.01,-1139.22",
        "1642.83,-1320.55 1641.38,-1310.05 1635.97,-1319.16 1642.83,-1320.55",
        "28.5975,-1390.97 28.5975,-1390.97 28.5975,-1390.97 28.5975,-1390.97",
        "1938.37,-1446.19 1948.61,-1443.48 1938.91,-1439.21 1938.37,-1446.19",
        "1907.08,-1476.96 1896.56,-1478.21 1905.57,-1483.79 1907.08,-1476.96",
        "28.5975,-1301.23 28.5975,-1301.23 28.5975,-1301.23 28.5975,-1301.23",
        "28.5975,-1211.49 28.5975,-1211.49 28.5975,-1211.49 28.5975,-1211.49",
        "2746.1,-1209.26 2735.57,-1210.45 2744.54,-1216.08 2746.1,-1209.26",
        "3073.11,-1230.21 3076.32,-1220.12 3067.51,-1226 3073.11,-1230.21",
        "3829.36,-1286.73 3839.36,-1283.23 3829.36,-1279.73 3829.36,-1286.73",
        "2929.67,-1286.73 2939.67,-1283.23 2929.67,-1279.73 2929.67,-1286.73",
        "2717.14,-1219.14 2706.68,-1217.43 2713.79,-1225.29 2717.14,-1219.14",
        "3025.06,-1221.09 3033.49,-1214.68 3022.89,-1214.44 3025.06,-1221.09",
        "2859.23,-1230.28 2861.14,-1219.85 2853.15,-1226.81 2859.23,-1230.28",
        "3225.36,-1127.71 3234.32,-1122.05 3223.79,-1120.89 3225.36,-1127.71",
        "2825.92,-1051.59 2825.78,-1041 2819.29,-1049.37 2825.92,-1051.59",
        "2756.04,-845.722 2765.66,-841.284 2755.37,-838.754 2756.04,-845.722",
        "2227.16,-870.308 2231.12,-860.481 2221.9,-865.694 2227.16,-870.308",
        "28.5975,-1121.75 28.5975,-1121.75 28.5975,-1121.75 28.5975,-1121.75",
        "3026.84,-1221.43 3035.33,-1215.1 3024.74,-1214.75 3026.84,-1221.43",
        "2801.64,-1196.99 2811.64,-1193.49 2801.64,-1189.99 2801.64,-1196.99",
        "3206.47,-1118.45 3216.03,-1113.89 3205.71,-1111.49 3206.47,-1118.45",
        "2802.84,-1049.44 2807.78,-1040.07 2798.07,-1044.31 2802.84,-1049.44",
        "2936.15,-861.783 2943.58,-854.225 2933.06,-855.503 2936.15,-861.783",
        "2799.06,-867.842 2804.57,-858.793 2794.62,-862.43 2799.06,-867.842",
        "2331.55,-506.483 2338.99,-498.933 2328.47,-500.2 2331.55,-506.483",
        "2519.21,-306.403 2528.96,-302.25 2518.75,-299.419 2519.21,-306.403",
        "3244.58,-1133.44 3252.44,-1126.33 3241.86,-1126.99 3244.58,-1133.44",
        "2881.42,-1042.05 2871.19,-1039.31 2877.48,-1047.84 2881.42,-1042.05",
        "3293.92,-1223.55 3302.04,-1216.74 3291.45,-1217 3293.92,-1223.55",
        "3225.98,-1127.79 3234.95,-1122.15 3224.42,-1120.97 3225.98,-1127.79",
        "3137.87,-692.571 3136.57,-682.057 3131.03,-691.089 3137.87,-692.571",
        "2912.77,-675.496 2902.17,-675.306 2910.34,-682.061 2912.77,-675.496",
        "3151.54,-511.774 3146.45,-502.487 3144.64,-512.926 3151.54,-511.774",
        "28.5975,-1032.01 28.5975,-1032.01 28.5975,-1032.01 28.5975,-1032.01",
        "2926.31,-1028.46 2915.83,-1030.05 2925.02,-1035.34 2926.31,-1028.46",
        "2884.33,-859.327 2873.91,-857.408 2880.86,-865.406 2884.33,-859.327",
        "3470.31,-692.558 3468.85,-682.064 3463.45,-691.178 3470.31,-692.558",
        "2737.65,-297.361 2727.51,-300.434 2737.35,-304.355 2737.65,-297.361",
        "2809.07,-212.272 2798.79,-214.837 2808.42,-219.242 2809.07,-212.272",
        "3883.24,-1107.25 3893.24,-1103.75 3883.24,-1100.25 3883.24,-1107.25",
        "1356.57,-961.69 1356.03,-951.11 1349.86,-959.722 1356.57,-961.69",
        "1292.69,-871.314 1294.46,-860.868 1286.56,-867.931 1292.69,-871.314",
        "3960.08,-1047.12 3951.92,-1040.37 3954.09,-1050.74 3960.08,-1047.12",
        "4043.35,-961.442 4040.87,-951.143 4036.39,-960.743 4043.35,-961.442",
        "28.5975,-942.271 28.5975,-942.271 28.5975,-942.271 28.5975,-942.271",
        "4717.54,-692.564 4716.42,-682.029 4710.72,-690.964 4717.54,-692.564",
        "2839.1,-871.537 2835.6,-861.537 2832.1,-871.537 2839.1,-871.537",
        "28.5975,-852.531 28.5975,-852.531 28.5975,-852.531 28.5975,-852.531",
        "4735.66,-690.596 4729.65,-681.872 4728.91,-692.441 4735.66,-690.596",
        "1334.89,-867.974 1326.78,-861.156 1328.87,-871.543 1334.89,-867.974",
        "28.5975,-762.791 28.5975,-762.791 28.5975,-762.791 28.5975,-762.791",
        "2915.15,-838.031 2925.15,-834.531 2915.15,-831.031 2915.15,-838.031",
        "3221.55,-859.412 3230.13,-853.196 3219.55,-852.705 3221.55,-859.412",
        "2349.59,-754.382 2339.17,-756.303 2348.51,-761.298 2349.59,-754.382",
        "3124.62,-691.806 3127.26,-681.543 3118.8,-687.923 3124.62,-691.806",
        "2616.45,-687.296 2607.6,-681.467 2610.88,-691.541 2616.45,-687.296",
        "2444.54,-680.276 2434.04,-678.84 2441.35,-686.508 2444.54,-680.276",
        "3405.08,-682.293 3413.54,-675.915 3402.94,-675.625 3405.08,-682.293",
        "2839.89,-692.077 2836.45,-682.057 2832.89,-692.037 2839.89,-692.077",
        "3125.72,-512.642 3127.84,-502.263 3119.71,-509.053 3125.72,-512.642",
        "2461.88,-497.568 2451.29,-497.288 2459.39,-504.112 2461.88,-497.568",
        "2521.31,-308.645 2530.95,-304.253 2520.68,-301.674 2521.31,-308.645",
        "2614.38,-216.502 2624.1,-212.305 2613.88,-209.519 2614.38,-216.502",
        "2863.74,-147.205 2854.59,-141.855 2858.41,-151.74 2863.74,-147.205",
        "3006.1,-153.773 3002.6,-143.773 2999.1,-153.773 3006.1,-153.773",
        "2268.51,-782.225 2266.86,-771.76 2261.62,-780.97 2268.51,-782.225",
        "2736.54,-299.372 2726.33,-302.192 2736.07,-306.357 2736.54,-299.372",
        "28.5975,-673.051 28.5975,-673.051 28.5975,-673.051 28.5975,-673.051",
        "2351.82,-688.992 2357.79,-680.24 2347.66,-683.358 2351.82,-688.992",
        "2746.16,-675.919 2755.41,-670.747 2744.95,-669.024 2746.16,-675.919",
        "3037.99,-484.065 3047.81,-480.089 3037.66,-477.073 3037.99,-484.065",
        "2352.99,-510.298 2358.35,-501.16 2348.46,-504.96 2352.99,-510.298",
        "2539.09,-318.334 2548.11,-312.783 2537.59,-311.495 2539.09,-318.334",
        "28.5975,-583.311 28.5975,-583.311 28.5975,-583.311 28.5975,-583.311",
        "3074.85,-503.353 3083.1,-496.701 3072.51,-496.759 3074.85,-503.353",
        "2394.1,-512.577 2390.6,-502.577 2387.1,-512.577 2394.1,-512.577",
        "3165.96,-509.052 3157.91,-502.164 3159.91,-512.568 3165.96,-509.052",
        "2737.94,-296.434 2727.83,-299.63 2737.72,-303.431 2737.94,-296.434",
        "3106.78,-509.997 3112.59,-501.138 3102.52,-504.439 3106.78,-509.997",
        "2644.31,-331.096 2637.4,-323.072 2637.8,-333.659 2644.31,-331.096",
        "2740.11,-239.257 2731.63,-232.898 2734.29,-243.154 2740.11,-239.257",
        "2835.1,-153.773 2831.6,-143.773 2828.1,-153.773 2835.1,-153.773",
        "28.5975,-493.571 28.5975,-493.571 28.5975,-493.571 28.5975,-493.571",
        "28.5975,-403.831 28.5975,-403.831 28.5975,-403.831 28.5975,-403.831",
        "2589.02,-330.354 2594.92,-321.559 2584.82,-324.751 2589.02,-330.354",
        "28.5975,-314.09 28.5975,-314.09 28.5975,-314.09 28.5975,-314.09",
        "28.5975,-224.35 28.5975,-224.35 28.5975,-224.35 28.5975,-224.35",
        "2683.92,-241.986 2688.36,-232.368 2678.89,-237.115 2683.92,-241.986",
        "2762.18,-131.527 2771.43,-126.369 2760.98,-124.63 2762.18,-131.527",
        "28.5975,-134.61 28.5975,-134.61 28.5975,-134.61 28.5975,-134.61",
        "28.5975,-44.8701 28.5975,-44.8701 28.5975,-44.8701 28.5975,-44.8701",
        "2903.12,-120.11 2913.12,-116.61 2903.12,-113.11 2903.12,-120.11",
        "305.125,-30.3702 315.125,-26.8701 305.125,-23.3702 305.125,-30.3702"
    ]
]